ranjithaguna/pv/LED_Demo/source/pic32cx/component/spi_slave.h
/**
 * \brief Component description for PIC32CX/0525SG12 SPI_SLAVE
 *
 * Copyright (c) 2018 Microchip Technology Inc.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description version 2018-04-24T21:15:30Z */
#ifndef _PIC32CX_0525SG12_SPI_SLAVE_COMPONENT_H_
#define _PIC32CX_0525SG12_SPI_SLAVE_COMPONENT_H_

/** \addtogroup PIC32CX_0525SG12_SPI_SLAVE SPI Slave Register.
 *  @{
 */
/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR SPI_SLAVE */
/* ========================================================================== */

/* -------- SPI_SLAVE_SSPI_CMM_CNFG : (SPI_SLAVE Offset: 0x00) (R/W 32) SPI Slave Communication Configuration Register.\n -------- */

typedef union
{
  struct
  {
    uint32_t SNG_QUD_SEL:1;             /**< bit:      0  This field defines the Single / Quad Wire mode of operation for SPI Slave block.         0 = Single Wire Slave SPI block operation.\n         1 = Quad Wire Slave SPI block operation.\n */
    uint32_t :7;                        /**< bit:   1..7  Reserved                                      */
    uint32_t TAR_TIM_SEL:3;             /**< bit:  8..10  Turn Around Time select for Quad wire mode.\n         0h = 1 cycle.         1h = 2 cycles.         2h = 4 cycles.         3h = 8 cycles.         Other values are reserved. */
    uint32_t :5;                        /**< bit: 11..15  Reserved                                      */
    uint32_t WAIT_TIME:8;               /**< bit: 16..23  These bits set the amount of wait time in cycles before transmitting data back to master.\n         During this wait time status bits will be transmitted\n */
    uint32_t :8;                        /**< bit: 24..31  Reserved                                      */
  };
  uint32_t w;
} __SPI_SLAVE_SSPI_CMM_CNFG_bits_t;
#define SPI_SLAVE_SSPI_CMM_CNFG_RESETVALUE  (0x00U)                                       /**<  (SPI_SLAVE_SSPI_CMM_CNFG) SPI Slave Communication Configuration Register.\n  Reset Value */

#define SPI_SLAVE_SSPI_CMM_CNFG_SNG_QUD_SEL_Pos (0)                                            /**< (SPI_SLAVE_SSPI_CMM_CNFG) This field defines the Single / Quad Wire mode of operation for SPI Slave block.         0 = Single Wire Slave SPI block operation.\n         1 = Quad Wire Slave SPI block operation.\n Position */
#define SPI_SLAVE_SSPI_CMM_CNFG_SNG_QUD_SEL_Msk (0x1U << SPI_SLAVE_SSPI_CMM_CNFG_SNG_QUD_SEL_Pos)  /**< (SPI_SLAVE_SSPI_CMM_CNFG) This field defines the Single / Quad Wire mode of operation for SPI Slave block.         0 = Single Wire Slave SPI block operation.\n         1 = Quad Wire Slave SPI block operation.\n Mask */
#define SPI_SLAVE_SSPI_CMM_CNFG_TAR_TIM_SEL_Pos (8)                                            /**< (SPI_SLAVE_SSPI_CMM_CNFG) Turn Around Time select for Quad wire mode.\n         0h = 1 cycle.         1h = 2 cycles.         2h = 4 cycles.         3h = 8 cycles.         Other values are reserved. Position */
#define SPI_SLAVE_SSPI_CMM_CNFG_TAR_TIM_SEL_Msk (0x7U << SPI_SLAVE_SSPI_CMM_CNFG_TAR_TIM_SEL_Pos)  /**< (SPI_SLAVE_SSPI_CMM_CNFG) Turn Around Time select for Quad wire mode.\n         0h = 1 cycle.         1h = 2 cycles.         2h = 4 cycles.         3h = 8 cycles.         Other values are reserved. Mask */
#define SPI_SLAVE_SSPI_CMM_CNFG_TAR_TIM_SEL(value) (SPI_SLAVE_SSPI_CMM_CNFG_TAR_TIM_SEL_Msk & ((value) << SPI_SLAVE_SSPI_CMM_CNFG_TAR_TIM_SEL_Pos))
#define SPI_SLAVE_SSPI_CMM_CNFG_WAIT_TIME_Pos (16)                                           /**< (SPI_SLAVE_SSPI_CMM_CNFG) These bits set the amount of wait time in cycles before transmitting data back to master.\n         During this wait time status bits will be transmitted\n Position */
#define SPI_SLAVE_SSPI_CMM_CNFG_WAIT_TIME_Msk (0xFFU << SPI_SLAVE_SSPI_CMM_CNFG_WAIT_TIME_Pos)  /**< (SPI_SLAVE_SSPI_CMM_CNFG) These bits set the amount of wait time in cycles before transmitting data back to master.\n         During this wait time status bits will be transmitted\n Mask */
#define SPI_SLAVE_SSPI_CMM_CNFG_WAIT_TIME(value) (SPI_SLAVE_SSPI_CMM_CNFG_WAIT_TIME_Msk & ((value) << SPI_SLAVE_SSPI_CMM_CNFG_WAIT_TIME_Pos))
#define SPI_SLAVE_SSPI_CMM_CNFG_Msk           (0x00FF0701UL)                                 /**< (SPI_SLAVE_SSPI_CMM_CNFG) Register Mask  */

/* -------- SPI_SLAVE_SSPI_STATUS : (SPI_SLAVE Offset: 0x04) (R/W 32) SPI Slave Status Register.\n -------- */

typedef union
{
  struct
  {
    uint32_t MEM_WR_DONE:1;             /**< bit:      0  When the ARM BUS side has fully finished the last transaction from the FIFO to write the data to\n         Memory for Posted Writes . Clear with new Write request.\n */
    uint32_t MEM_RD_DONE:1;             /**< bit:      1  When the ARM BUS side has fully finished writing the last written DWord to the FIFO for a set of data\n         read from Memory for Posted Reads. - cleared with new Read request.\n */
    uint32_t :1;                        /**< bit:      2  Reserved                                      */
    uint32_t MEM_WR_BUSY:1;             /**< bit:      3  When an Memory Write transaction is currently being processed.\n */
    uint32_t MEM_RD_BUSY:1;             /**< bit:      4  When an Memory Read transaction is currently being processed.\n */
    uint32_t SREG_TRANS:1;              /**< bit:      5  When an SREG transaction is currently being processed.\n */
    uint32_t POLL_HIGH:1;               /**< bit:      6  If this bit is set, then something in the high 16-bit of status register is set and needs to be checked.\n         SPI Master should take action to clear this.\n */
    uint32_t :1;                        /**< bit:      7  Reserved                                      */
    uint32_t RX_FIFO_EMPTY:1;           /**< bit:      8  Signifies all Memory write transactions for the SPI Masters requested size have been performed.\n         New transactions are allowed.\n */
    uint32_t RX_FIFO_FULL:1;            /**< bit:      9  The RX FIFO is full of data to be written to Memory.\n */
    uint32_t TX_FIFO_EMPTY:1;           /**< bit:     10  Signifies SPI Master has read the data requested from Memory. Can be used to show there is data\n         the SPI Master has requested and not been read yet. New read transactions will be aligned.\n */
    uint32_t TX_FIFO_FULL:1;            /**< bit:     11  The TX FIFO is full of data that was read from Memory.\n */
    uint32_t :1;                        /**< bit:     12  Reserved                                      */
    uint32_t TM_CLK_CNT_ERR:1;          /**< bit:     13  This bit is set when the SPI Clock Count Test Mode is set and there is an uneven amount of clocks.\n */
    uint32_t IBF_FLG:1;                 /**< bit:     14  Set when the Host writes to the Input Buffer signaling there is data for the EC to read.\n */
    uint32_t OBF_FLG:1;                 /**< bit:     15  Set when the EC writes to the Output Buffer signaling there is data for the Host to read.\n */
    uint32_t SPIM_RST_REQ:1;            /**< bit:     16  Set when the SPI Master Requested a Configuration Reset.\n */
    uint32_t RXFIFO_RST_DN:1;           /**< bit:     17  Set after the SPI Master initiates a RX FIFO reset and the reset has been processed. FIFO is cleared.\n */
    uint32_t TXFIFO_RST_DN:1;           /**< bit:     18  Set after the SPI Master initiates a TX FIFO reset and the reset has been processed. FIFO is cleared.\n */
    uint32_t OOL0_ERR:1;                /**< bit:     19  This flag is set with the transfer address requested by the master is out of Limit 0 range or when the BAR is disabled.\n */
    uint32_t OOL1_ERR:1;                /**< bit:     20  This flag is set with the transfer address requested by the master is out of Limit 1 range or when the BAR is disabled.\n */
    uint32_t ARMBUS_ERR:1;              /**< bit:     21  ARM Bus Error returned for the curren data transfer.\n */
    uint32_t UNDEF_CMD_ERR:1;           /**< bit:     22  Undefined Command Error: The command received from the master isn't defined.\n */
    uint32_t DV_BUSY:1;                 /**< bit:     23  If the Master requested a transaction whose destination is busy the request is ignored.\n         Should use the poll or wait for interrupts.\n */
    uint32_t RXFIFO_SIZE_ERR:1;         /**< bit:     24  If size requested is more than what Master provided and the Master terminates early error flag         shut down request signal to ARM Bus. Size requested is less than what Master provided -- ignored and         continue transaction, may be taking in garbage.\n */
    uint32_t TXFIFO_UNDERFLOW:1;        /**< bit:     25  If Master reads more than what is in FIFO, FIFO will flag an underflow error and the data returned         will just be the last valid pointer value.\n */
    uint32_t TXFIFO_OVRFLOW:1;          /**< bit:     26  If Master doesn't read all of the data it requested from the posted read block cycle, than data         will still be left in the FIFO. This will cause misalignment with the following transactions and a new         read cycle can cause overflow.\n */
    uint32_t RXFIFO_UNDERFLOW:1;        /**< bit:     27  If the SPI Slave reads RX FIFO when it is empty, RX FIFO Underflow flag will be set. This condition         will never happen under normal situation.\n */
    uint32_t RXFIFO_OVRFLOW:1;          /**< bit:     28  If SPI Master writes more than the space in the FIFO, the FIFO will flag an overflow error and data         will not be stored.\n */
    uint32_t :3;                        /**< bit: 29..31  Reserved                                      */
  };
  uint32_t w;
} __SPI_SLAVE_SSPI_STATUS_bits_t;
#define SPI_SLAVE_SSPI_STATUS_RESETVALUE    (0x500U)                                      /**<  (SPI_SLAVE_SSPI_STATUS) SPI Slave Status Register.\n  Reset Value */

