ranjithaguna/pv/LED_Demo/source/pic32cx/component/spi_slave.h
#define SPI_SLAVE_SSPI_STATUS_MEM_WR_DONE_Pos (0)                                            /**< (SPI_SLAVE_SSPI_STATUS) When the ARM BUS side has fully finished the last transaction from the FIFO to write the data to\n         Memory for Posted Writes . Clear with new Write request.\n Position */
#define SPI_SLAVE_SSPI_STATUS_MEM_WR_DONE_Msk (0x1U << SPI_SLAVE_SSPI_STATUS_MEM_WR_DONE_Pos)  /**< (SPI_SLAVE_SSPI_STATUS) When the ARM BUS side has fully finished the last transaction from the FIFO to write the data to\n         Memory for Posted Writes . Clear with new Write request.\n Mask */
#define SPI_SLAVE_SSPI_STATUS_MEM_RD_DONE_Pos (1)                                            /**< (SPI_SLAVE_SSPI_STATUS) When the ARM BUS side has fully finished writing the last written DWord to the FIFO for a set of data\n         read from Memory for Posted Reads. - cleared with new Read request.\n Position */
#define SPI_SLAVE_SSPI_STATUS_MEM_RD_DONE_Msk (0x1U << SPI_SLAVE_SSPI_STATUS_MEM_RD_DONE_Pos)  /**< (SPI_SLAVE_SSPI_STATUS) When the ARM BUS side has fully finished writing the last written DWord to the FIFO for a set of data\n         read from Memory for Posted Reads. - cleared with new Read request.\n Mask */
#define SPI_SLAVE_SSPI_STATUS_MEM_WR_BUSY_Pos (3)                                            /**< (SPI_SLAVE_SSPI_STATUS) When an Memory Write transaction is currently being processed.\n Position */
#define SPI_SLAVE_SSPI_STATUS_MEM_WR_BUSY_Msk (0x1U << SPI_SLAVE_SSPI_STATUS_MEM_WR_BUSY_Pos)  /**< (SPI_SLAVE_SSPI_STATUS) When an Memory Write transaction is currently being processed.\n Mask */
#define SPI_SLAVE_SSPI_STATUS_MEM_RD_BUSY_Pos (4)                                            /**< (SPI_SLAVE_SSPI_STATUS) When an Memory Read transaction is currently being processed.\n Position */
#define SPI_SLAVE_SSPI_STATUS_MEM_RD_BUSY_Msk (0x1U << SPI_SLAVE_SSPI_STATUS_MEM_RD_BUSY_Pos)  /**< (SPI_SLAVE_SSPI_STATUS) When an Memory Read transaction is currently being processed.\n Mask */
#define SPI_SLAVE_SSPI_STATUS_SREG_TRANS_Pos  (5)                                            /**< (SPI_SLAVE_SSPI_STATUS) When an SREG transaction is currently being processed.\n Position */
#define SPI_SLAVE_SSPI_STATUS_SREG_TRANS_Msk  (0x1U << SPI_SLAVE_SSPI_STATUS_SREG_TRANS_Pos)  /**< (SPI_SLAVE_SSPI_STATUS) When an SREG transaction is currently being processed.\n Mask */
#define SPI_SLAVE_SSPI_STATUS_POLL_HIGH_Pos   (6)                                            /**< (SPI_SLAVE_SSPI_STATUS) If this bit is set, then something in the high 16-bit of status register is set and needs to be checked.\n         SPI Master should take action to clear this.\n Position */
#define SPI_SLAVE_SSPI_STATUS_POLL_HIGH_Msk   (0x1U << SPI_SLAVE_SSPI_STATUS_POLL_HIGH_Pos)  /**< (SPI_SLAVE_SSPI_STATUS) If this bit is set, then something in the high 16-bit of status register is set and needs to be checked.\n         SPI Master should take action to clear this.\n Mask */
#define SPI_SLAVE_SSPI_STATUS_RX_FIFO_EMPTY_Pos (8)                                            /**< (SPI_SLAVE_SSPI_STATUS) Signifies all Memory write transactions for the SPI Masters requested size have been performed.\n         New transactions are allowed.\n Position */
#define SPI_SLAVE_SSPI_STATUS_RX_FIFO_EMPTY_Msk (0x1U << SPI_SLAVE_SSPI_STATUS_RX_FIFO_EMPTY_Pos)  /**< (SPI_SLAVE_SSPI_STATUS) Signifies all Memory write transactions for the SPI Masters requested size have been performed.\n         New transactions are allowed.\n Mask */
#define SPI_SLAVE_SSPI_STATUS_RX_FIFO_FULL_Pos (9)                                            /**< (SPI_SLAVE_SSPI_STATUS) The RX FIFO is full of data to be written to Memory.\n Position */
#define SPI_SLAVE_SSPI_STATUS_RX_FIFO_FULL_Msk (0x1U << SPI_SLAVE_SSPI_STATUS_RX_FIFO_FULL_Pos)  /**< (SPI_SLAVE_SSPI_STATUS) The RX FIFO is full of data to be written to Memory.\n Mask */
#define SPI_SLAVE_SSPI_STATUS_TX_FIFO_EMPTY_Pos (10)                                           /**< (SPI_SLAVE_SSPI_STATUS) Signifies SPI Master has read the data requested from Memory. Can be used to show there is data\n         the SPI Master has requested and not been read yet. New read transactions will be aligned.\n Position */
#define SPI_SLAVE_SSPI_STATUS_TX_FIFO_EMPTY_Msk (0x1U << SPI_SLAVE_SSPI_STATUS_TX_FIFO_EMPTY_Pos)  /**< (SPI_SLAVE_SSPI_STATUS) Signifies SPI Master has read the data requested from Memory. Can be used to show there is data\n         the SPI Master has requested and not been read yet. New read transactions will be aligned.\n Mask */
#define SPI_SLAVE_SSPI_STATUS_TX_FIFO_FULL_Pos (11)                                           /**< (SPI_SLAVE_SSPI_STATUS) The TX FIFO is full of data that was read from Memory.\n Position */
#define SPI_SLAVE_SSPI_STATUS_TX_FIFO_FULL_Msk (0x1U << SPI_SLAVE_SSPI_STATUS_TX_FIFO_FULL_Pos)  /**< (SPI_SLAVE_SSPI_STATUS) The TX FIFO is full of data that was read from Memory.\n Mask */
#define SPI_SLAVE_SSPI_STATUS_TM_CLK_CNT_ERR_Pos (13)                                           /**< (SPI_SLAVE_SSPI_STATUS) This bit is set when the SPI Clock Count Test Mode is set and there is an uneven amount of clocks.\n Position */
#define SPI_SLAVE_SSPI_STATUS_TM_CLK_CNT_ERR_Msk (0x1U << SPI_SLAVE_SSPI_STATUS_TM_CLK_CNT_ERR_Pos)  /**< (SPI_SLAVE_SSPI_STATUS) This bit is set when the SPI Clock Count Test Mode is set and there is an uneven amount of clocks.\n Mask */
#define SPI_SLAVE_SSPI_STATUS_IBF_FLG_Pos     (14)                                           /**< (SPI_SLAVE_SSPI_STATUS) Set when the Host writes to the Input Buffer signaling there is data for the EC to read.\n Position */
#define SPI_SLAVE_SSPI_STATUS_IBF_FLG_Msk     (0x1U << SPI_SLAVE_SSPI_STATUS_IBF_FLG_Pos)    /**< (SPI_SLAVE_SSPI_STATUS) Set when the Host writes to the Input Buffer signaling there is data for the EC to read.\n Mask */
#define SPI_SLAVE_SSPI_STATUS_OBF_FLG_Pos     (15)                                           /**< (SPI_SLAVE_SSPI_STATUS) Set when the EC writes to the Output Buffer signaling there is data for the Host to read.\n Position */
#define SPI_SLAVE_SSPI_STATUS_OBF_FLG_Msk     (0x1U << SPI_SLAVE_SSPI_STATUS_OBF_FLG_Pos)    /**< (SPI_SLAVE_SSPI_STATUS) Set when the EC writes to the Output Buffer signaling there is data for the Host to read.\n Mask */
#define SPI_SLAVE_SSPI_STATUS_SPIM_RST_REQ_Pos (16)                                           /**< (SPI_SLAVE_SSPI_STATUS) Set when the SPI Master Requested a Configuration Reset.\n Position */
#define SPI_SLAVE_SSPI_STATUS_SPIM_RST_REQ_Msk (0x1U << SPI_SLAVE_SSPI_STATUS_SPIM_RST_REQ_Pos)  /**< (SPI_SLAVE_SSPI_STATUS) Set when the SPI Master Requested a Configuration Reset.\n Mask */
#define SPI_SLAVE_SSPI_STATUS_RXFIFO_RST_DN_Pos (17)                                           /**< (SPI_SLAVE_SSPI_STATUS) Set after the SPI Master initiates a RX FIFO reset and the reset has been processed. FIFO is cleared.\n Position */
#define SPI_SLAVE_SSPI_STATUS_RXFIFO_RST_DN_Msk (0x1U << SPI_SLAVE_SSPI_STATUS_RXFIFO_RST_DN_Pos)  /**< (SPI_SLAVE_SSPI_STATUS) Set after the SPI Master initiates a RX FIFO reset and the reset has been processed. FIFO is cleared.\n Mask */
#define SPI_SLAVE_SSPI_STATUS_TXFIFO_RST_DN_Pos (18)                                           /**< (SPI_SLAVE_SSPI_STATUS) Set after the SPI Master initiates a TX FIFO reset and the reset has been processed. FIFO is cleared.\n Position */
#define SPI_SLAVE_SSPI_STATUS_TXFIFO_RST_DN_Msk (0x1U << SPI_SLAVE_SSPI_STATUS_TXFIFO_RST_DN_Pos)  /**< (SPI_SLAVE_SSPI_STATUS) Set after the SPI Master initiates a TX FIFO reset and the reset has been processed. FIFO is cleared.\n Mask */
#define SPI_SLAVE_SSPI_STATUS_OOL0_ERR_Pos    (19)                                           /**< (SPI_SLAVE_SSPI_STATUS) This flag is set with the transfer address requested by the master is out of Limit 0 range or when the BAR is disabled.\n Position */
#define SPI_SLAVE_SSPI_STATUS_OOL0_ERR_Msk    (0x1U << SPI_SLAVE_SSPI_STATUS_OOL0_ERR_Pos)   /**< (SPI_SLAVE_SSPI_STATUS) This flag is set with the transfer address requested by the master is out of Limit 0 range or when the BAR is disabled.\n Mask */
#define SPI_SLAVE_SSPI_STATUS_OOL1_ERR_Pos    (20)                                           /**< (SPI_SLAVE_SSPI_STATUS) This flag is set with the transfer address requested by the master is out of Limit 1 range or when the BAR is disabled.\n Position */
#define SPI_SLAVE_SSPI_STATUS_OOL1_ERR_Msk    (0x1U << SPI_SLAVE_SSPI_STATUS_OOL1_ERR_Pos)   /**< (SPI_SLAVE_SSPI_STATUS) This flag is set with the transfer address requested by the master is out of Limit 1 range or when the BAR is disabled.\n Mask */
#define SPI_SLAVE_SSPI_STATUS_ARMBUS_ERR_Pos  (21)                                           /**< (SPI_SLAVE_SSPI_STATUS) ARM Bus Error returned for the curren data transfer.\n Position */
#define SPI_SLAVE_SSPI_STATUS_ARMBUS_ERR_Msk  (0x1U << SPI_SLAVE_SSPI_STATUS_ARMBUS_ERR_Pos)  /**< (SPI_SLAVE_SSPI_STATUS) ARM Bus Error returned for the curren data transfer.\n Mask */
#define SPI_SLAVE_SSPI_STATUS_UNDEF_CMD_ERR_Pos (22)                                           /**< (SPI_SLAVE_SSPI_STATUS) Undefined Command Error: The command received from the master isn't defined.\n Position */
#define SPI_SLAVE_SSPI_STATUS_UNDEF_CMD_ERR_Msk (0x1U << SPI_SLAVE_SSPI_STATUS_UNDEF_CMD_ERR_Pos)  /**< (SPI_SLAVE_SSPI_STATUS) Undefined Command Error: The command received from the master isn't defined.\n Mask */
#define SPI_SLAVE_SSPI_STATUS_DV_BUSY_Pos     (23)                                           /**< (SPI_SLAVE_SSPI_STATUS) If the Master requested a transaction whose destination is busy the request is ignored.\n         Should use the poll or wait for interrupts.\n Position */
#define SPI_SLAVE_SSPI_STATUS_DV_BUSY_Msk     (0x1U << SPI_SLAVE_SSPI_STATUS_DV_BUSY_Pos)    /**< (SPI_SLAVE_SSPI_STATUS) If the Master requested a transaction whose destination is busy the request is ignored.\n         Should use the poll or wait for interrupts.\n Mask */
#define SPI_SLAVE_SSPI_STATUS_RXFIFO_SIZE_ERR_Pos (24)                                           /**< (SPI_SLAVE_SSPI_STATUS) If size requested is more than what Master provided and the Master terminates early error flag         shut down request signal to ARM Bus. Size requested is less than what Master provided -- ignored and         continue transaction, may be taking in garbage.\n Position */
#define SPI_SLAVE_SSPI_STATUS_RXFIFO_SIZE_ERR_Msk (0x1U << SPI_SLAVE_SSPI_STATUS_RXFIFO_SIZE_ERR_Pos)  /**< (SPI_SLAVE_SSPI_STATUS) If size requested is more than what Master provided and the Master terminates early error flag         shut down request signal to ARM Bus. Size requested is less than what Master provided -- ignored and         continue transaction, may be taking in garbage.\n Mask */
#define SPI_SLAVE_SSPI_STATUS_TXFIFO_UNDERFLOW_Pos (25)                                           /**< (SPI_SLAVE_SSPI_STATUS) If Master reads more than what is in FIFO, FIFO will flag an underflow error and the data returned         will just be the last valid pointer value.\n Position */
#define SPI_SLAVE_SSPI_STATUS_TXFIFO_UNDERFLOW_Msk (0x1U << SPI_SLAVE_SSPI_STATUS_TXFIFO_UNDERFLOW_Pos)  /**< (SPI_SLAVE_SSPI_STATUS) If Master reads more than what is in FIFO, FIFO will flag an underflow error and the data returned         will just be the last valid pointer value.\n Mask */
#define SPI_SLAVE_SSPI_STATUS_TXFIFO_OVRFLOW_Pos (26)                                           /**< (SPI_SLAVE_SSPI_STATUS) If Master doesn't read all of the data it requested from the posted read block cycle, than data         will still be left in the FIFO. This will cause misalignment with the following transactions and a new         read cycle can cause overflow.\n Position */
#define SPI_SLAVE_SSPI_STATUS_TXFIFO_OVRFLOW_Msk (0x1U << SPI_SLAVE_SSPI_STATUS_TXFIFO_OVRFLOW_Pos)  /**< (SPI_SLAVE_SSPI_STATUS) If Master doesn't read all of the data it requested from the posted read block cycle, than data         will still be left in the FIFO. This will cause misalignment with the following transactions and a new         read cycle can cause overflow.\n Mask */
#define SPI_SLAVE_SSPI_STATUS_RXFIFO_UNDERFLOW_Pos (27)                                           /**< (SPI_SLAVE_SSPI_STATUS) If the SPI Slave reads RX FIFO when it is empty, RX FIFO Underflow flag will be set. This condition         will never happen under normal situation.\n Position */
#define SPI_SLAVE_SSPI_STATUS_RXFIFO_UNDERFLOW_Msk (0x1U << SPI_SLAVE_SSPI_STATUS_RXFIFO_UNDERFLOW_Pos)  /**< (SPI_SLAVE_SSPI_STATUS) If the SPI Slave reads RX FIFO when it is empty, RX FIFO Underflow flag will be set. This condition         will never happen under normal situation.\n Mask */
#define SPI_SLAVE_SSPI_STATUS_RXFIFO_OVRFLOW_Pos (28)                                           /**< (SPI_SLAVE_SSPI_STATUS) If SPI Master writes more than the space in the FIFO, the FIFO will flag an overflow error and data         will not be stored.\n Position */
#define SPI_SLAVE_SSPI_STATUS_RXFIFO_OVRFLOW_Msk (0x1U << SPI_SLAVE_SSPI_STATUS_RXFIFO_OVRFLOW_Pos)  /**< (SPI_SLAVE_SSPI_STATUS) If SPI Master writes more than the space in the FIFO, the FIFO will flag an overflow error and data         will not be stored.\n Mask */
#define SPI_SLAVE_SSPI_STATUS_Msk             (0x1FFFEF7BUL)                                 /**< (SPI_SLAVE_SSPI_STATUS) Register Mask  */

/* -------- SPI_SLAVE_SSPI_EC_STATUS : (SPI_SLAVE Offset: 0x08) (R/W 32) SPI Slave EC Status Register.\n -------- */

typedef union
{
  struct
  {
    uint32_t MEM_WR_DONE:1;             /**< bit:      0  When the ARM BUS side has fully finished the last transaction from the FIFO to write the data to\n         Memory for Posted Writes .- clear with new Write request.\n */
    uint32_t MEM_RD_DONE:1;             /**< bit:      1  When the ARM BUS side has fully finished writing the last written DWord to the FIFO for a set of data\n         read from Memory for Posted Reads. - cleared with new Read request.\n */
    uint32_t :1;                        /**< bit:      2  Reserved                                      */
    uint32_t MEM_WR_BUSY:1;             /**< bit:      3  When an Memory Write transaction is currently being processed.\n */
    uint32_t MEM_RD_BUSY:1;             /**< bit:      4  When an Memory Read transaction is currently being processed.\n */
    uint32_t SREG_TRANS:1;              /**< bit:      5  When an SREG transaction is currently being processed.\n */
    uint32_t POLL_HIGH:1;               /**< bit:      6  If this bit is set, then something in the high 16-bit of status register is set and needs to be checked.\n         SPI Master should take action to clear this.\n */
    uint32_t :1;                        /**< bit:      7  Reserved                                      */
    uint32_t RX_FIFO_EMPTY:1;           /**< bit:      8  Signifies all Memory write transactions for the SPI Masters requested size have been performed.\n         New transactions are allowed.\n */
    uint32_t RX_FIFO_FULL:1;            /**< bit:      9  The RX FIFO is full of data to be written to Memory.\n */
    uint32_t TX_FIFO_EMPTY:1;           /**< bit:     10  Signifies SPI Master has read the data requested from Memory. Can be used to show there is data\n         the SPI Master has requested and not been read yet. New read transactions will be aligned.\n */
    uint32_t TX_FIFO_FULL:1;            /**< bit:     11  The TX FIFO is full of data that was read from Memory.\n */
    uint32_t :1;                        /**< bit:     12  Reserved                                      */
    uint32_t TM_CLK_CNT_ERR:1;          /**< bit:     13  This bit is set when the SPI Clock Count Test Mode is set and there is an uneven amount of clocks.\n */
    uint32_t IBF_FLG:1;                 /**< bit:     14  Set when the Host writes to the Input Buffer signaling there is data for the EC to read.\n */
    uint32_t OBF_FLG:1;                 /**< bit:     15  Set when the EC writes to the Output Buffer signaling there is data for the Host to read.\n */
    uint32_t SPIM_RST_REQ:1;            /**< bit:     16  Set when the SPI Master Requested a Configuration Reset.\n */
    uint32_t RXFIFO_RST_DN:1;           /**< bit:     17  Set after the SPI Master initiates a RX FIFO reset and the reset has been processed. FIFO is cleared.\n */
    uint32_t TXFIFO_RST_DN:1;           /**< bit:     18  Set after the SPI Master initiates a TX FIFO reset and the reset has been processed. FIFO is cleared.\n */
    uint32_t OOL0_ERR:1;                /**< bit:     19  This flag is set with the transfer address requested by the master is out of Limit 0 range or when the BAR is disabled.\n */
    uint32_t OOL1_ERR:1;                /**< bit:     20  This flag is set with the transfer address requested by the master is out of Limit 1 range or when the BAR is disabled.\n */
    uint32_t ARMBUS_ERR:1;              /**< bit:     21  ARM Bus Error returned for the curren data transfer.\n */
    uint32_t UNDEF_CMD_ERR:1;           /**< bit:     22  Undefined Command Error: The command received from the master isn't defined.\n */
    uint32_t DV_BUSY:1;                 /**< bit:     23  If the Master requested a transaction whose destination is busy the request is ignored.\n         Should use the poll or wait for interrupts.\n */
    uint32_t RXFIFO_SIZE_ERR:1;         /**< bit:     24  If size requested is more than what Master provided and the Master terminates early error flag         shut down request signal to ARM Bus. Size requested is less than what Master provided -- ignored and         continue transaction, may be taking in garbage.\n */
    uint32_t TXFIFO_UNDERFLOW:1;        /**< bit:     25  If Master reads more than what is in FIFO, FIFO will flag an underflow error and the data returned         will just be the last valid pointer value.\n */
    uint32_t TXFIFO_OVRFLOW:1;          /**< bit:     26  If Master doesn't read all of the data it requested from the posted read block cycle, than data         will still be left in the FIFO. This will cause misalignment with the following transactions and a new         read cycle can cause overflow.\n */
    uint32_t RXFIFO_UNDERFLOW:1;        /**< bit:     27  If the SPI Slave reads RX FIFO when it is empty, RX FIFO Underflow flag will be set. This condition         will never happen under normal situation.\n */
    uint32_t RXFIFO_OVRFLOW:1;          /**< bit:     28  If SPI Master writes more than the space in the FIFO, the FIFO will flag an overflow error and data         will not be stored.\n */
    uint32_t :3;                        /**< bit: 29..31  Reserved                                      */
  };
  uint32_t w;
} __SPI_SLAVE_SSPI_EC_STATUS_bits_t;
#define SPI_SLAVE_SSPI_EC_STATUS_RESETVALUE (0x500U)                                      /**<  (SPI_SLAVE_SSPI_EC_STATUS) SPI Slave EC Status Register.\n  Reset Value */

