ranjithaguna/pv/LED_Demo/source/pic32cx/component/spi_slave.h
#define SPI_SLAVE_SSPI_INT_EN_MEM_WR_DONE_Pos (0)                                            /**< (SPI_SLAVE_SSPI_INT_EN) Enable Memory Write Done Interrupt to SPI Master.\n Position */
#define SPI_SLAVE_SSPI_INT_EN_MEM_WR_DONE_Msk (0x1U << SPI_SLAVE_SSPI_INT_EN_MEM_WR_DONE_Pos)  /**< (SPI_SLAVE_SSPI_INT_EN) Enable Memory Write Done Interrupt to SPI Master.\n Mask */
#define SPI_SLAVE_SSPI_INT_EN_MEM_RD_DONE_Pos (1)                                            /**< (SPI_SLAVE_SSPI_INT_EN) Enable Memory Read Done Interrupt to SPI Master.\n Position */
#define SPI_SLAVE_SSPI_INT_EN_MEM_RD_DONE_Msk (0x1U << SPI_SLAVE_SSPI_INT_EN_MEM_RD_DONE_Pos)  /**< (SPI_SLAVE_SSPI_INT_EN) Enable Memory Read Done Interrupt to SPI Master.\n Mask */
#define SPI_SLAVE_SSPI_INT_EN_MEM_WR_BUSY_Pos (3)                                            /**< (SPI_SLAVE_SSPI_INT_EN) Enable Memory Write Busy Interrupt to SPI Master.\n Position */
#define SPI_SLAVE_SSPI_INT_EN_MEM_WR_BUSY_Msk (0x1U << SPI_SLAVE_SSPI_INT_EN_MEM_WR_BUSY_Pos)  /**< (SPI_SLAVE_SSPI_INT_EN) Enable Memory Write Busy Interrupt to SPI Master.\n Mask */
#define SPI_SLAVE_SSPI_INT_EN_MEM_RD_BUSY_Pos (4)                                            /**< (SPI_SLAVE_SSPI_INT_EN) Enable Memory Read Busy Interrupt to SPI Master.\n Position */
#define SPI_SLAVE_SSPI_INT_EN_MEM_RD_BUSY_Msk (0x1U << SPI_SLAVE_SSPI_INT_EN_MEM_RD_BUSY_Pos)  /**< (SPI_SLAVE_SSPI_INT_EN) Enable Memory Read Busy Interrupt to SPI Master.\n Mask */
#define SPI_SLAVE_SSPI_INT_EN_SREG_TRANS_Pos  (5)                                            /**< (SPI_SLAVE_SSPI_INT_EN) Enable SREG Trans Busy Interrupt to SPI Master.\n Position */
#define SPI_SLAVE_SSPI_INT_EN_SREG_TRANS_Msk  (0x1U << SPI_SLAVE_SSPI_INT_EN_SREG_TRANS_Pos)  /**< (SPI_SLAVE_SSPI_INT_EN) Enable SREG Trans Busy Interrupt to SPI Master.\n Mask */
#define SPI_SLAVE_SSPI_INT_EN_POLL_HIGH_Pos   (6)                                            /**< (SPI_SLAVE_SSPI_INT_EN) Enable Poll High Request Interrupt to SPI Master.\n Position */
#define SPI_SLAVE_SSPI_INT_EN_POLL_HIGH_Msk   (0x1U << SPI_SLAVE_SSPI_INT_EN_POLL_HIGH_Pos)  /**< (SPI_SLAVE_SSPI_INT_EN) Enable Poll High Request Interrupt to SPI Master.\n Mask */
#define SPI_SLAVE_SSPI_INT_EN_RX_FIFO_EMPTY_Pos (8)                                            /**< (SPI_SLAVE_SSPI_INT_EN) Enable SREG RX FIFO Empty Interrupt to SPI Master.\n Position */
#define SPI_SLAVE_SSPI_INT_EN_RX_FIFO_EMPTY_Msk (0x1U << SPI_SLAVE_SSPI_INT_EN_RX_FIFO_EMPTY_Pos)  /**< (SPI_SLAVE_SSPI_INT_EN) Enable SREG RX FIFO Empty Interrupt to SPI Master.\n Mask */
#define SPI_SLAVE_SSPI_INT_EN_RX_FIFO_FULL_Pos (9)                                            /**< (SPI_SLAVE_SSPI_INT_EN) Enable RX FIFO Full Interrupt to SPI Master.\n Position */
#define SPI_SLAVE_SSPI_INT_EN_RX_FIFO_FULL_Msk (0x1U << SPI_SLAVE_SSPI_INT_EN_RX_FIFO_FULL_Pos)  /**< (SPI_SLAVE_SSPI_INT_EN) Enable RX FIFO Full Interrupt to SPI Master.\n Mask */
#define SPI_SLAVE_SSPI_INT_EN_TX_FIFO_EMPTY_Pos (10)                                           /**< (SPI_SLAVE_SSPI_INT_EN) Enable TX FIFO Empty Interrupt to SPI Master.\n Position */
#define SPI_SLAVE_SSPI_INT_EN_TX_FIFO_EMPTY_Msk (0x1U << SPI_SLAVE_SSPI_INT_EN_TX_FIFO_EMPTY_Pos)  /**< (SPI_SLAVE_SSPI_INT_EN) Enable TX FIFO Empty Interrupt to SPI Master.\n Mask */
#define SPI_SLAVE_SSPI_INT_EN_TX_FIFO_FULL_Pos (11)                                           /**< (SPI_SLAVE_SSPI_INT_EN) Enable TX FIFI FULL Interrupt to SPI Master.\n Position */
#define SPI_SLAVE_SSPI_INT_EN_TX_FIFO_FULL_Msk (0x1U << SPI_SLAVE_SSPI_INT_EN_TX_FIFO_FULL_Pos)  /**< (SPI_SLAVE_SSPI_INT_EN) Enable TX FIFI FULL Interrupt to SPI Master.\n Mask */
#define SPI_SLAVE_SSPI_INT_EN_TM_CLK_CNT_ERR_Pos (13)                                           /**< (SPI_SLAVE_SSPI_INT_EN) Enable Test Mode SPI Clock Count Error Interrupt to SPI Master.\n Position */
#define SPI_SLAVE_SSPI_INT_EN_TM_CLK_CNT_ERR_Msk (0x1U << SPI_SLAVE_SSPI_INT_EN_TM_CLK_CNT_ERR_Pos)  /**< (SPI_SLAVE_SSPI_INT_EN) Enable Test Mode SPI Clock Count Error Interrupt to SPI Master.\n Mask */
#define SPI_SLAVE_SSPI_INT_EN_IBF_FLG_Pos     (14)                                           /**< (SPI_SLAVE_SSPI_INT_EN) Enable Input Buffer Signaling Interrupt to SPI Master.\n Position */
#define SPI_SLAVE_SSPI_INT_EN_IBF_FLG_Msk     (0x1U << SPI_SLAVE_SSPI_INT_EN_IBF_FLG_Pos)    /**< (SPI_SLAVE_SSPI_INT_EN) Enable Input Buffer Signaling Interrupt to SPI Master.\n Mask */
#define SPI_SLAVE_SSPI_INT_EN_OBF_FLG_Pos     (15)                                           /**< (SPI_SLAVE_SSPI_INT_EN) Enable Output Buffer signaling Interrupt to SPI Master.\n Position */
#define SPI_SLAVE_SSPI_INT_EN_OBF_FLG_Msk     (0x1U << SPI_SLAVE_SSPI_INT_EN_OBF_FLG_Pos)    /**< (SPI_SLAVE_SSPI_INT_EN) Enable Output Buffer signaling Interrupt to SPI Master.\n Mask */
#define SPI_SLAVE_SSPI_INT_EN_SPIM_RST_REQ_Pos (16)                                           /**< (SPI_SLAVE_SSPI_INT_EN) Enable SPI Master Request Reset Interrupt to SPI Master.\n Position */
#define SPI_SLAVE_SSPI_INT_EN_SPIM_RST_REQ_Msk (0x1U << SPI_SLAVE_SSPI_INT_EN_SPIM_RST_REQ_Pos)  /**< (SPI_SLAVE_SSPI_INT_EN) Enable SPI Master Request Reset Interrupt to SPI Master.\n Mask */
#define SPI_SLAVE_SSPI_INT_EN_RXFIFO_RST_DN_Pos (17)                                           /**< (SPI_SLAVE_SSPI_INT_EN) Enable RX FIFO Reset Done Interrupt to SPI Master.\n Position */
#define SPI_SLAVE_SSPI_INT_EN_RXFIFO_RST_DN_Msk (0x1U << SPI_SLAVE_SSPI_INT_EN_RXFIFO_RST_DN_Pos)  /**< (SPI_SLAVE_SSPI_INT_EN) Enable RX FIFO Reset Done Interrupt to SPI Master.\n Mask */
#define SPI_SLAVE_SSPI_INT_EN_TXFIFO_RST_DN_Pos (18)                                           /**< (SPI_SLAVE_SSPI_INT_EN) Enable TX FIFO Reset Done Interrupt to SPI Master.\n Position */
#define SPI_SLAVE_SSPI_INT_EN_TXFIFO_RST_DN_Msk (0x1U << SPI_SLAVE_SSPI_INT_EN_TXFIFO_RST_DN_Pos)  /**< (SPI_SLAVE_SSPI_INT_EN) Enable TX FIFO Reset Done Interrupt to SPI Master.\n Mask */
#define SPI_SLAVE_SSPI_INT_EN_OOL0_ERR_Pos    (19)                                           /**< (SPI_SLAVE_SSPI_INT_EN) Enable Out Of Limit 0 Error Interrupt to SPI Master.\n Position */
#define SPI_SLAVE_SSPI_INT_EN_OOL0_ERR_Msk    (0x1U << SPI_SLAVE_SSPI_INT_EN_OOL0_ERR_Pos)   /**< (SPI_SLAVE_SSPI_INT_EN) Enable Out Of Limit 0 Error Interrupt to SPI Master.\n Mask */
#define SPI_SLAVE_SSPI_INT_EN_OOL1_ERR_Pos    (20)                                           /**< (SPI_SLAVE_SSPI_INT_EN) Enable Out Of Limit 1 Error Interrupt to SPI Master.\n Position */
#define SPI_SLAVE_SSPI_INT_EN_OOL1_ERR_Msk    (0x1U << SPI_SLAVE_SSPI_INT_EN_OOL1_ERR_Pos)   /**< (SPI_SLAVE_SSPI_INT_EN) Enable Out Of Limit 1 Error Interrupt to SPI Master.\n Mask */
#define SPI_SLAVE_SSPI_INT_EN_ARMBUS_ERR_Pos  (21)                                           /**< (SPI_SLAVE_SSPI_INT_EN) Enable AHB BUS Error Interrupt to SPI Master.\n Position */
#define SPI_SLAVE_SSPI_INT_EN_ARMBUS_ERR_Msk  (0x1U << SPI_SLAVE_SSPI_INT_EN_ARMBUS_ERR_Pos)  /**< (SPI_SLAVE_SSPI_INT_EN) Enable AHB BUS Error Interrupt to SPI Master.\n Mask */
#define SPI_SLAVE_SSPI_INT_EN_UNDEF_CMD_ERR_Pos (22)                                           /**< (SPI_SLAVE_SSPI_INT_EN) Enable Undefined Command Error Interrupt to SPI Master.\n Position */
#define SPI_SLAVE_SSPI_INT_EN_UNDEF_CMD_ERR_Msk (0x1U << SPI_SLAVE_SSPI_INT_EN_UNDEF_CMD_ERR_Pos)  /**< (SPI_SLAVE_SSPI_INT_EN) Enable Undefined Command Error Interrupt to SPI Master.\n Mask */
#define SPI_SLAVE_SSPI_INT_EN_DV_BUSY_Pos     (23)                                           /**< (SPI_SLAVE_SSPI_INT_EN) Enable Device Busy Interrupt to SPI Master.\n Position */
#define SPI_SLAVE_SSPI_INT_EN_DV_BUSY_Msk     (0x1U << SPI_SLAVE_SSPI_INT_EN_DV_BUSY_Pos)    /**< (SPI_SLAVE_SSPI_INT_EN) Enable Device Busy Interrupt to SPI Master.\n Mask */
#define SPI_SLAVE_SSPI_INT_EN_RXFIFO_SIZE_ERR_Pos (24)                                           /**< (SPI_SLAVE_SSPI_INT_EN) Enable RX FIFO SIZE Error Interrupt to SPI Master.\n Position */
#define SPI_SLAVE_SSPI_INT_EN_RXFIFO_SIZE_ERR_Msk (0x1U << SPI_SLAVE_SSPI_INT_EN_RXFIFO_SIZE_ERR_Pos)  /**< (SPI_SLAVE_SSPI_INT_EN) Enable RX FIFO SIZE Error Interrupt to SPI Master.\n Mask */
#define SPI_SLAVE_SSPI_INT_EN_TXFIFO_UNDERFLOW_Pos (25)                                           /**< (SPI_SLAVE_SSPI_INT_EN) Enable TX FIFO Underflow Interrupt to SPI Master.\n Position */
#define SPI_SLAVE_SSPI_INT_EN_TXFIFO_UNDERFLOW_Msk (0x1U << SPI_SLAVE_SSPI_INT_EN_TXFIFO_UNDERFLOW_Pos)  /**< (SPI_SLAVE_SSPI_INT_EN) Enable TX FIFO Underflow Interrupt to SPI Master.\n Mask */
#define SPI_SLAVE_SSPI_INT_EN_TXFIFO_OVRFLOW_Pos (26)                                           /**< (SPI_SLAVE_SSPI_INT_EN) Enable TX FIFO Overflow Interrupt to SPI Master.\n Position */
#define SPI_SLAVE_SSPI_INT_EN_TXFIFO_OVRFLOW_Msk (0x1U << SPI_SLAVE_SSPI_INT_EN_TXFIFO_OVRFLOW_Pos)  /**< (SPI_SLAVE_SSPI_INT_EN) Enable TX FIFO Overflow Interrupt to SPI Master.\n Mask */
#define SPI_SLAVE_SSPI_INT_EN_RXFIFO_UNDERFLOW_Pos (27)                                           /**< (SPI_SLAVE_SSPI_INT_EN) Enable RX FIFO Underflow Interrupt to SPI Master.\n Position */
#define SPI_SLAVE_SSPI_INT_EN_RXFIFO_UNDERFLOW_Msk (0x1U << SPI_SLAVE_SSPI_INT_EN_RXFIFO_UNDERFLOW_Pos)  /**< (SPI_SLAVE_SSPI_INT_EN) Enable RX FIFO Underflow Interrupt to SPI Master.\n Mask */
#define SPI_SLAVE_SSPI_INT_EN_RXFIFO_OVRFLOW_Pos (28)                                           /**< (SPI_SLAVE_SSPI_INT_EN) Enable RX FIFO Overflow Interrupt to SPI Master.\n Position */
#define SPI_SLAVE_SSPI_INT_EN_RXFIFO_OVRFLOW_Msk (0x1U << SPI_SLAVE_SSPI_INT_EN_RXFIFO_OVRFLOW_Pos)  /**< (SPI_SLAVE_SSPI_INT_EN) Enable RX FIFO Overflow Interrupt to SPI Master.\n Mask */
#define SPI_SLAVE_SSPI_INT_EN_Msk             (0x1FFFEF7BUL)                                 /**< (SPI_SLAVE_SSPI_INT_EN) Register Mask  */

