ranjithaguna/pv/LED_Demo/source/pic32cx/component/spi_slave.h
/* -------- SPI_SLAVE_SSPI_EC_INT_EN : (SPI_SLAVE Offset: 0x10) (R/W 32) SPI Slave EC Interrupt Enable Register.\n -------- */

typedef union
{
  struct
  {
    uint32_t MEM_WR_DONE:1;             /**< bit:      0  Enable Memory Write Done Interrupt to EC.\n   */
    uint32_t MEM_RD_DONE:1;             /**< bit:      1  Enable Memory Read Done Interrupt to EC.\n    */
    uint32_t :1;                        /**< bit:      2  Reserved                                      */
    uint32_t MEM_WR_BUSY:1;             /**< bit:      3  Enable Memory Write Busy Interrupt to EC.\n   */
    uint32_t MEM_RD_BUSY:1;             /**< bit:      4  Enable Memory Read Busy Interrupt to EC.\n    */
    uint32_t SREG_TRANS:1;              /**< bit:      5  Enable SREG Trans Busy Interrupt to EC.\n     */
    uint32_t POLL_HIGH:1;               /**< bit:      6  Enable Poll High Request Interrupt to EC.\n   */
    uint32_t :1;                        /**< bit:      7  Reserved                                      */
    uint32_t RX_FIFO_EMPTY:1;           /**< bit:      8  Enable SREG RX FIFO Empty Interrupt to EC.\n  */
    uint32_t RX_FIFO_FULL:1;            /**< bit:      9  Enable RX FIFO Full Interrupt to EC.\n        */
    uint32_t TX_FIFO_EMPTY:1;           /**< bit:     10  Enable TX FIFO Empty Interrupt to EC.\n       */
    uint32_t TX_FIFO_FULL:1;            /**< bit:     11  Enable TX FIFI FULL Interrupt to EC.\n        */
    uint32_t :1;                        /**< bit:     12  Reserved                                      */
    uint32_t TM_CLK_CNT_ERR:1;          /**< bit:     13  Enable Test Mode SPI Clock Count Error Interrupt to EC.\n */
    uint32_t IBF_FLG:1;                 /**< bit:     14  Enable Input Buffer Signaling Interrupt to EC.\n */
    uint32_t OBF_FLG:1;                 /**< bit:     15  Enable Output Buffer signaling Interrupt to EC.\n */
    uint32_t SPIM_RST_REQ:1;            /**< bit:     16  Enable SPI Master Request Reset Interrupt to EC.\n */
    uint32_t RXFIFO_RST_DN:1;           /**< bit:     17  Enable RX FIFO Reset Done Interrupt to EC.\n  */
    uint32_t TXFIFO_RST_DN:1;           /**< bit:     18  Enable TX FIFO Reset Done Interrupt to EC.\n  */
    uint32_t OOL0_ERR:1;                /**< bit:     19  Enable Out Of Limit 0 Error Interrupt to EC.\n */
    uint32_t OOL1_ERR:1;                /**< bit:     20  Enable Out Of Limit 1 Error Interrupt to EC.\n */
    uint32_t ARMBUS_ERR:1;              /**< bit:     21  Enable AHB BUS Error Interrupt to EC.\n       */
    uint32_t UNDEF_CMD_ERR:1;           /**< bit:     22  Enable Undefined Command Error Interrupt to EC.\n */
    uint32_t DV_BUSY:1;                 /**< bit:     23  Enable Device Busy Interrupt to EC.\n         */
    uint32_t RXFIFO_SIZE_ERR:1;         /**< bit:     24  Enable RX FIFO SIZE Error Interrupt to EC.\n  */
    uint32_t TXFIFO_UNDERFLOW:1;        /**< bit:     25  Enable TX FIFO Underflow Interrupt to EC.\n   */
    uint32_t TXFIFO_OVRFLOW:1;          /**< bit:     26  Enable TX FIFO Overflow Interrupt to EC.\n    */
    uint32_t RXFIFO_UNDERFLOW:1;        /**< bit:     27  Enable RX FIFO Underflow Interrupt to EC.\n   */
    uint32_t RXFIFO_OVRFLOW:1;          /**< bit:     28  Enable RX FIFO Overflow Interrupt to EC.\n    */
    uint32_t :3;                        /**< bit: 29..31  Reserved                                      */
  };
  uint32_t w;
} __SPI_SLAVE_SSPI_EC_INT_EN_bits_t;
#define SPI_SLAVE_SSPI_EC_INT_EN_RESETVALUE (0x00U)                                       /**<  (SPI_SLAVE_SSPI_EC_INT_EN) SPI Slave EC Interrupt Enable Register.\n  Reset Value */

#define SPI_SLAVE_SSPI_EC_INT_EN_MEM_WR_DONE_Pos (0)                                            /**< (SPI_SLAVE_SSPI_EC_INT_EN) Enable Memory Write Done Interrupt to EC.\n Position */
#define SPI_SLAVE_SSPI_EC_INT_EN_MEM_WR_DONE_Msk (0x1U << SPI_SLAVE_SSPI_EC_INT_EN_MEM_WR_DONE_Pos)  /**< (SPI_SLAVE_SSPI_EC_INT_EN) Enable Memory Write Done Interrupt to EC.\n Mask */
#define SPI_SLAVE_SSPI_EC_INT_EN_MEM_RD_DONE_Pos (1)                                            /**< (SPI_SLAVE_SSPI_EC_INT_EN) Enable Memory Read Done Interrupt to EC.\n Position */
#define SPI_SLAVE_SSPI_EC_INT_EN_MEM_RD_DONE_Msk (0x1U << SPI_SLAVE_SSPI_EC_INT_EN_MEM_RD_DONE_Pos)  /**< (SPI_SLAVE_SSPI_EC_INT_EN) Enable Memory Read Done Interrupt to EC.\n Mask */
#define SPI_SLAVE_SSPI_EC_INT_EN_MEM_WR_BUSY_Pos (3)                                            /**< (SPI_SLAVE_SSPI_EC_INT_EN) Enable Memory Write Busy Interrupt to EC.\n Position */
#define SPI_SLAVE_SSPI_EC_INT_EN_MEM_WR_BUSY_Msk (0x1U << SPI_SLAVE_SSPI_EC_INT_EN_MEM_WR_BUSY_Pos)  /**< (SPI_SLAVE_SSPI_EC_INT_EN) Enable Memory Write Busy Interrupt to EC.\n Mask */
#define SPI_SLAVE_SSPI_EC_INT_EN_MEM_RD_BUSY_Pos (4)                                            /**< (SPI_SLAVE_SSPI_EC_INT_EN) Enable Memory Read Busy Interrupt to EC.\n Position */
#define SPI_SLAVE_SSPI_EC_INT_EN_MEM_RD_BUSY_Msk (0x1U << SPI_SLAVE_SSPI_EC_INT_EN_MEM_RD_BUSY_Pos)  /**< (SPI_SLAVE_SSPI_EC_INT_EN) Enable Memory Read Busy Interrupt to EC.\n Mask */
#define SPI_SLAVE_SSPI_EC_INT_EN_SREG_TRANS_Pos (5)                                            /**< (SPI_SLAVE_SSPI_EC_INT_EN) Enable SREG Trans Busy Interrupt to EC.\n Position */
#define SPI_SLAVE_SSPI_EC_INT_EN_SREG_TRANS_Msk (0x1U << SPI_SLAVE_SSPI_EC_INT_EN_SREG_TRANS_Pos)  /**< (SPI_SLAVE_SSPI_EC_INT_EN) Enable SREG Trans Busy Interrupt to EC.\n Mask */
#define SPI_SLAVE_SSPI_EC_INT_EN_POLL_HIGH_Pos (6)                                            /**< (SPI_SLAVE_SSPI_EC_INT_EN) Enable Poll High Request Interrupt to EC.\n Position */
#define SPI_SLAVE_SSPI_EC_INT_EN_POLL_HIGH_Msk (0x1U << SPI_SLAVE_SSPI_EC_INT_EN_POLL_HIGH_Pos)  /**< (SPI_SLAVE_SSPI_EC_INT_EN) Enable Poll High Request Interrupt to EC.\n Mask */
#define SPI_SLAVE_SSPI_EC_INT_EN_RX_FIFO_EMPTY_Pos (8)                                            /**< (SPI_SLAVE_SSPI_EC_INT_EN) Enable SREG RX FIFO Empty Interrupt to EC.\n Position */
#define SPI_SLAVE_SSPI_EC_INT_EN_RX_FIFO_EMPTY_Msk (0x1U << SPI_SLAVE_SSPI_EC_INT_EN_RX_FIFO_EMPTY_Pos)  /**< (SPI_SLAVE_SSPI_EC_INT_EN) Enable SREG RX FIFO Empty Interrupt to EC.\n Mask */
#define SPI_SLAVE_SSPI_EC_INT_EN_RX_FIFO_FULL_Pos (9)                                            /**< (SPI_SLAVE_SSPI_EC_INT_EN) Enable RX FIFO Full Interrupt to EC.\n Position */
#define SPI_SLAVE_SSPI_EC_INT_EN_RX_FIFO_FULL_Msk (0x1U << SPI_SLAVE_SSPI_EC_INT_EN_RX_FIFO_FULL_Pos)  /**< (SPI_SLAVE_SSPI_EC_INT_EN) Enable RX FIFO Full Interrupt to EC.\n Mask */
#define SPI_SLAVE_SSPI_EC_INT_EN_TX_FIFO_EMPTY_Pos (10)                                           /**< (SPI_SLAVE_SSPI_EC_INT_EN) Enable TX FIFO Empty Interrupt to EC.\n Position */
#define SPI_SLAVE_SSPI_EC_INT_EN_TX_FIFO_EMPTY_Msk (0x1U << SPI_SLAVE_SSPI_EC_INT_EN_TX_FIFO_EMPTY_Pos)  /**< (SPI_SLAVE_SSPI_EC_INT_EN) Enable TX FIFO Empty Interrupt to EC.\n Mask */
#define SPI_SLAVE_SSPI_EC_INT_EN_TX_FIFO_FULL_Pos (11)                                           /**< (SPI_SLAVE_SSPI_EC_INT_EN) Enable TX FIFI FULL Interrupt to EC.\n Position */
#define SPI_SLAVE_SSPI_EC_INT_EN_TX_FIFO_FULL_Msk (0x1U << SPI_SLAVE_SSPI_EC_INT_EN_TX_FIFO_FULL_Pos)  /**< (SPI_SLAVE_SSPI_EC_INT_EN) Enable TX FIFI FULL Interrupt to EC.\n Mask */
#define SPI_SLAVE_SSPI_EC_INT_EN_TM_CLK_CNT_ERR_Pos (13)                                           /**< (SPI_SLAVE_SSPI_EC_INT_EN) Enable Test Mode SPI Clock Count Error Interrupt to EC.\n Position */
#define SPI_SLAVE_SSPI_EC_INT_EN_TM_CLK_CNT_ERR_Msk (0x1U << SPI_SLAVE_SSPI_EC_INT_EN_TM_CLK_CNT_ERR_Pos)  /**< (SPI_SLAVE_SSPI_EC_INT_EN) Enable Test Mode SPI Clock Count Error Interrupt to EC.\n Mask */
#define SPI_SLAVE_SSPI_EC_INT_EN_IBF_FLG_Pos  (14)                                           /**< (SPI_SLAVE_SSPI_EC_INT_EN) Enable Input Buffer Signaling Interrupt to EC.\n Position */
#define SPI_SLAVE_SSPI_EC_INT_EN_IBF_FLG_Msk  (0x1U << SPI_SLAVE_SSPI_EC_INT_EN_IBF_FLG_Pos)  /**< (SPI_SLAVE_SSPI_EC_INT_EN) Enable Input Buffer Signaling Interrupt to EC.\n Mask */
#define SPI_SLAVE_SSPI_EC_INT_EN_OBF_FLG_Pos  (15)                                           /**< (SPI_SLAVE_SSPI_EC_INT_EN) Enable Output Buffer signaling Interrupt to EC.\n Position */
#define SPI_SLAVE_SSPI_EC_INT_EN_OBF_FLG_Msk  (0x1U << SPI_SLAVE_SSPI_EC_INT_EN_OBF_FLG_Pos)  /**< (SPI_SLAVE_SSPI_EC_INT_EN) Enable Output Buffer signaling Interrupt to EC.\n Mask */
#define SPI_SLAVE_SSPI_EC_INT_EN_SPIM_RST_REQ_Pos (16)                                           /**< (SPI_SLAVE_SSPI_EC_INT_EN) Enable SPI Master Request Reset Interrupt to EC.\n Position */
#define SPI_SLAVE_SSPI_EC_INT_EN_SPIM_RST_REQ_Msk (0x1U << SPI_SLAVE_SSPI_EC_INT_EN_SPIM_RST_REQ_Pos)  /**< (SPI_SLAVE_SSPI_EC_INT_EN) Enable SPI Master Request Reset Interrupt to EC.\n Mask */
#define SPI_SLAVE_SSPI_EC_INT_EN_RXFIFO_RST_DN_Pos (17)                                           /**< (SPI_SLAVE_SSPI_EC_INT_EN) Enable RX FIFO Reset Done Interrupt to EC.\n Position */
#define SPI_SLAVE_SSPI_EC_INT_EN_RXFIFO_RST_DN_Msk (0x1U << SPI_SLAVE_SSPI_EC_INT_EN_RXFIFO_RST_DN_Pos)  /**< (SPI_SLAVE_SSPI_EC_INT_EN) Enable RX FIFO Reset Done Interrupt to EC.\n Mask */
#define SPI_SLAVE_SSPI_EC_INT_EN_TXFIFO_RST_DN_Pos (18)                                           /**< (SPI_SLAVE_SSPI_EC_INT_EN) Enable TX FIFO Reset Done Interrupt to EC.\n Position */
#define SPI_SLAVE_SSPI_EC_INT_EN_TXFIFO_RST_DN_Msk (0x1U << SPI_SLAVE_SSPI_EC_INT_EN_TXFIFO_RST_DN_Pos)  /**< (SPI_SLAVE_SSPI_EC_INT_EN) Enable TX FIFO Reset Done Interrupt to EC.\n Mask */
#define SPI_SLAVE_SSPI_EC_INT_EN_OOL0_ERR_Pos (19)                                           /**< (SPI_SLAVE_SSPI_EC_INT_EN) Enable Out Of Limit 0 Error Interrupt to EC.\n Position */
#define SPI_SLAVE_SSPI_EC_INT_EN_OOL0_ERR_Msk (0x1U << SPI_SLAVE_SSPI_EC_INT_EN_OOL0_ERR_Pos)  /**< (SPI_SLAVE_SSPI_EC_INT_EN) Enable Out Of Limit 0 Error Interrupt to EC.\n Mask */
#define SPI_SLAVE_SSPI_EC_INT_EN_OOL1_ERR_Pos (20)                                           /**< (SPI_SLAVE_SSPI_EC_INT_EN) Enable Out Of Limit 1 Error Interrupt to EC.\n Position */
#define SPI_SLAVE_SSPI_EC_INT_EN_OOL1_ERR_Msk (0x1U << SPI_SLAVE_SSPI_EC_INT_EN_OOL1_ERR_Pos)  /**< (SPI_SLAVE_SSPI_EC_INT_EN) Enable Out Of Limit 1 Error Interrupt to EC.\n Mask */
#define SPI_SLAVE_SSPI_EC_INT_EN_ARMBUS_ERR_Pos (21)                                           /**< (SPI_SLAVE_SSPI_EC_INT_EN) Enable AHB BUS Error Interrupt to EC.\n Position */
#define SPI_SLAVE_SSPI_EC_INT_EN_ARMBUS_ERR_Msk (0x1U << SPI_SLAVE_SSPI_EC_INT_EN_ARMBUS_ERR_Pos)  /**< (SPI_SLAVE_SSPI_EC_INT_EN) Enable AHB BUS Error Interrupt to EC.\n Mask */
#define SPI_SLAVE_SSPI_EC_INT_EN_UNDEF_CMD_ERR_Pos (22)                                           /**< (SPI_SLAVE_SSPI_EC_INT_EN) Enable Undefined Command Error Interrupt to EC.\n Position */
#define SPI_SLAVE_SSPI_EC_INT_EN_UNDEF_CMD_ERR_Msk (0x1U << SPI_SLAVE_SSPI_EC_INT_EN_UNDEF_CMD_ERR_Pos)  /**< (SPI_SLAVE_SSPI_EC_INT_EN) Enable Undefined Command Error Interrupt to EC.\n Mask */
#define SPI_SLAVE_SSPI_EC_INT_EN_DV_BUSY_Pos  (23)                                           /**< (SPI_SLAVE_SSPI_EC_INT_EN) Enable Device Busy Interrupt to EC.\n Position */
#define SPI_SLAVE_SSPI_EC_INT_EN_DV_BUSY_Msk  (0x1U << SPI_SLAVE_SSPI_EC_INT_EN_DV_BUSY_Pos)  /**< (SPI_SLAVE_SSPI_EC_INT_EN) Enable Device Busy Interrupt to EC.\n Mask */
#define SPI_SLAVE_SSPI_EC_INT_EN_RXFIFO_SIZE_ERR_Pos (24)                                           /**< (SPI_SLAVE_SSPI_EC_INT_EN) Enable RX FIFO SIZE Error Interrupt to EC.\n Position */
#define SPI_SLAVE_SSPI_EC_INT_EN_RXFIFO_SIZE_ERR_Msk (0x1U << SPI_SLAVE_SSPI_EC_INT_EN_RXFIFO_SIZE_ERR_Pos)  /**< (SPI_SLAVE_SSPI_EC_INT_EN) Enable RX FIFO SIZE Error Interrupt to EC.\n Mask */
#define SPI_SLAVE_SSPI_EC_INT_EN_TXFIFO_UNDERFLOW_Pos (25)                                           /**< (SPI_SLAVE_SSPI_EC_INT_EN) Enable TX FIFO Underflow Interrupt to EC.\n Position */
#define SPI_SLAVE_SSPI_EC_INT_EN_TXFIFO_UNDERFLOW_Msk (0x1U << SPI_SLAVE_SSPI_EC_INT_EN_TXFIFO_UNDERFLOW_Pos)  /**< (SPI_SLAVE_SSPI_EC_INT_EN) Enable TX FIFO Underflow Interrupt to EC.\n Mask */
#define SPI_SLAVE_SSPI_EC_INT_EN_TXFIFO_OVRFLOW_Pos (26)                                           /**< (SPI_SLAVE_SSPI_EC_INT_EN) Enable TX FIFO Overflow Interrupt to EC.\n Position */
#define SPI_SLAVE_SSPI_EC_INT_EN_TXFIFO_OVRFLOW_Msk (0x1U << SPI_SLAVE_SSPI_EC_INT_EN_TXFIFO_OVRFLOW_Pos)  /**< (SPI_SLAVE_SSPI_EC_INT_EN) Enable TX FIFO Overflow Interrupt to EC.\n Mask */
#define SPI_SLAVE_SSPI_EC_INT_EN_RXFIFO_UNDERFLOW_Pos (27)                                           /**< (SPI_SLAVE_SSPI_EC_INT_EN) Enable RX FIFO Underflow Interrupt to EC.\n Position */
#define SPI_SLAVE_SSPI_EC_INT_EN_RXFIFO_UNDERFLOW_Msk (0x1U << SPI_SLAVE_SSPI_EC_INT_EN_RXFIFO_UNDERFLOW_Pos)  /**< (SPI_SLAVE_SSPI_EC_INT_EN) Enable RX FIFO Underflow Interrupt to EC.\n Mask */
#define SPI_SLAVE_SSPI_EC_INT_EN_RXFIFO_OVRFLOW_Pos (28)                                           /**< (SPI_SLAVE_SSPI_EC_INT_EN) Enable RX FIFO Overflow Interrupt to EC.\n Position */
#define SPI_SLAVE_SSPI_EC_INT_EN_RXFIFO_OVRFLOW_Msk (0x1U << SPI_SLAVE_SSPI_EC_INT_EN_RXFIFO_OVRFLOW_Pos)  /**< (SPI_SLAVE_SSPI_EC_INT_EN) Enable RX FIFO Overflow Interrupt to EC.\n Mask */
#define SPI_SLAVE_SSPI_EC_INT_EN_Msk          (0x1FFFEF7BUL)                                 /**< (SPI_SLAVE_SSPI_EC_INT_EN) Register Mask  */

/* -------- SPI_SLAVE_SSPI_MEM_CFG : (SPI_SLAVE Offset: 0x14) (R/W 32) SPI Slave Memory Configuration Register.\n -------- */

typedef union
{
  struct
  {
    uint32_t BAR_EN0_SEL:1;             /**< bit:      0  Enables Region 0 operation.         0 = Disable Region 0.\n         1 = Enable Region 0.\n */
    uint32_t BAR_EN1_SEL:1;             /**< bit:      1  Enables Region 1 operation.         0 = Disable Region 1.\n         1 = Enable Region 1.\n */
    uint32_t :30;                       /**< bit:  2..31  Reserved                                      */
  };
  uint32_t w;
} __SPI_SLAVE_SSPI_MEM_CFG_bits_t;
#define SPI_SLAVE_SSPI_MEM_CFG_RESETVALUE   (0x00U)                                       /**<  (SPI_SLAVE_SSPI_MEM_CFG) SPI Slave Memory Configuration Register.\n  Reset Value */

#define SPI_SLAVE_SSPI_MEM_CFG_BAR_EN0_SEL_Pos (0)                                            /**< (SPI_SLAVE_SSPI_MEM_CFG) Enables Region 0 operation.         0 = Disable Region 0.\n         1 = Enable Region 0.\n Position */
#define SPI_SLAVE_SSPI_MEM_CFG_BAR_EN0_SEL_Msk (0x1U << SPI_SLAVE_SSPI_MEM_CFG_BAR_EN0_SEL_Pos)  /**< (SPI_SLAVE_SSPI_MEM_CFG) Enables Region 0 operation.         0 = Disable Region 0.\n         1 = Enable Region 0.\n Mask */
#define SPI_SLAVE_SSPI_MEM_CFG_BAR_EN1_SEL_Pos (1)                                            /**< (SPI_SLAVE_SSPI_MEM_CFG) Enables Region 1 operation.         0 = Disable Region 1.\n         1 = Enable Region 1.\n Position */
#define SPI_SLAVE_SSPI_MEM_CFG_BAR_EN1_SEL_Msk (0x1U << SPI_SLAVE_SSPI_MEM_CFG_BAR_EN1_SEL_Pos)  /**< (SPI_SLAVE_SSPI_MEM_CFG) Enables Region 1 operation.         0 = Disable Region 1.\n         1 = Enable Region 1.\n Mask */
#define SPI_SLAVE_SSPI_MEM_CFG_Msk            (0x00000003UL)                                 /**< (SPI_SLAVE_SSPI_MEM_CFG) Register Mask  */

/* -------- SPI_SLAVE_SSPI_MEM0_BADD : (SPI_SLAVE Offset: 0x18) (R/W 32) SPI Slave Memory Base Address0 Register.\n -------- */

typedef union
{
  struct
  {
    uint32_t MEM_BAS_ADD0:32;           /**< bit:  0..31  Base Address for Region 0.\n                  */
  };
  uint32_t w;
} __SPI_SLAVE_SSPI_MEM0_BADD_bits_t;
#define SPI_SLAVE_SSPI_MEM0_BADD_RESETVALUE (0x00U)                                       /**<  (SPI_SLAVE_SSPI_MEM0_BADD) SPI Slave Memory Base Address0 Register.\n  Reset Value */

#define SPI_SLAVE_SSPI_MEM0_BADD_MEM_BAS_ADD0_Pos (0)                                            /**< (SPI_SLAVE_SSPI_MEM0_BADD) Base Address for Region 0.\n Position */
#define SPI_SLAVE_SSPI_MEM0_BADD_MEM_BAS_ADD0_Msk (0xFFFFFFFFU << SPI_SLAVE_SSPI_MEM0_BADD_MEM_BAS_ADD0_Pos)  /**< (SPI_SLAVE_SSPI_MEM0_BADD) Base Address for Region 0.\n Mask */
#define SPI_SLAVE_SSPI_MEM0_BADD_MEM_BAS_ADD0(value) (SPI_SLAVE_SSPI_MEM0_BADD_MEM_BAS_ADD0_Msk & ((value) << SPI_SLAVE_SSPI_MEM0_BADD_MEM_BAS_ADD0_Pos))
#define SPI_SLAVE_SSPI_MEM0_BADD_Msk          (0xFFFFFFFFUL)                                 /**< (SPI_SLAVE_SSPI_MEM0_BADD) Register Mask  */

/* -------- SPI_SLAVE_SSPI_MEM0_WR_LMT : (SPI_SLAVE Offset: 0x1c) (R/W 32) SPI Slave Memory Write LIMIT 0 Register.\n -------- */

typedef union
{
  struct
  {
    uint32_t WR_LMT0:15;                /**< bit:  0..14  Write Limit for Region 0.\n                   */
    uint32_t :17;                       /**< bit: 15..31  Reserved                                      */
  };
  uint32_t w;
} __SPI_SLAVE_SSPI_MEM0_WR_LMT_bits_t;
#define SPI_SLAVE_SSPI_MEM0_WR_LMT_RESETVALUE (0x00U)                                       /**<  (SPI_SLAVE_SSPI_MEM0_WR_LMT) SPI Slave Memory Write LIMIT 0 Register.\n  Reset Value */

#define SPI_SLAVE_SSPI_MEM0_WR_LMT_WR_LMT0_Pos (0)                                            /**< (SPI_SLAVE_SSPI_MEM0_WR_LMT) Write Limit for Region 0.\n Position */
#define SPI_SLAVE_SSPI_MEM0_WR_LMT_WR_LMT0_Msk (0x7FFFU << SPI_SLAVE_SSPI_MEM0_WR_LMT_WR_LMT0_Pos)  /**< (SPI_SLAVE_SSPI_MEM0_WR_LMT) Write Limit for Region 0.\n Mask */
#define SPI_SLAVE_SSPI_MEM0_WR_LMT_WR_LMT0(value) (SPI_SLAVE_SSPI_MEM0_WR_LMT_WR_LMT0_Msk & ((value) << SPI_SLAVE_SSPI_MEM0_WR_LMT_WR_LMT0_Pos))
#define SPI_SLAVE_SSPI_MEM0_WR_LMT_Msk        (0x00007FFFUL)                                 /**< (SPI_SLAVE_SSPI_MEM0_WR_LMT) Register Mask  */

/* -------- SPI_SLAVE_SSPI_MEM0_RD_LMT : (SPI_SLAVE Offset: 0x20) (R/W 32) SPI Slave Memory Read LIMIT 0 Register.\n -------- */

typedef union
{
  struct
  {
    uint32_t RD_LMT0:15;                /**< bit:  0..14  Read Limit for Region 0.\n                    */
    uint32_t :17;                       /**< bit: 15..31  Reserved                                      */
  };
  uint32_t w;
} __SPI_SLAVE_SSPI_MEM0_RD_LMT_bits_t;
#define SPI_SLAVE_SSPI_MEM0_RD_LMT_RESETVALUE (0x00U)                                       /**<  (SPI_SLAVE_SSPI_MEM0_RD_LMT) SPI Slave Memory Read LIMIT 0 Register.\n  Reset Value */

#define SPI_SLAVE_SSPI_MEM0_RD_LMT_RD_LMT0_Pos (0)                                            /**< (SPI_SLAVE_SSPI_MEM0_RD_LMT) Read Limit for Region 0.\n Position */
#define SPI_SLAVE_SSPI_MEM0_RD_LMT_RD_LMT0_Msk (0x7FFFU << SPI_SLAVE_SSPI_MEM0_RD_LMT_RD_LMT0_Pos)  /**< (SPI_SLAVE_SSPI_MEM0_RD_LMT) Read Limit for Region 0.\n Mask */
#define SPI_SLAVE_SSPI_MEM0_RD_LMT_RD_LMT0(value) (SPI_SLAVE_SSPI_MEM0_RD_LMT_RD_LMT0_Msk & ((value) << SPI_SLAVE_SSPI_MEM0_RD_LMT_RD_LMT0_Pos))
#define SPI_SLAVE_SSPI_MEM0_RD_LMT_Msk        (0x00007FFFUL)                                 /**< (SPI_SLAVE_SSPI_MEM0_RD_LMT) Register Mask  */

/* -------- SPI_SLAVE_SSPI_MEM1_BADD : (SPI_SLAVE Offset: 0x24) (R/W 32) SPI Slave Memory Base Address1 Register.\n -------- */

typedef union
{
  struct
  {
    uint32_t MEM_BAS_ADD1:32;           /**< bit:  0..31  Base Address for Region 1.\n                  */
  };
  uint32_t w;
} __SPI_SLAVE_SSPI_MEM1_BADD_bits_t;
#define SPI_SLAVE_SSPI_MEM1_BADD_RESETVALUE (0x00U)                                       /**<  (SPI_SLAVE_SSPI_MEM1_BADD) SPI Slave Memory Base Address1 Register.\n  Reset Value */

#define SPI_SLAVE_SSPI_MEM1_BADD_MEM_BAS_ADD1_Pos (0)                                            /**< (SPI_SLAVE_SSPI_MEM1_BADD) Base Address for Region 1.\n Position */
#define SPI_SLAVE_SSPI_MEM1_BADD_MEM_BAS_ADD1_Msk (0xFFFFFFFFU << SPI_SLAVE_SSPI_MEM1_BADD_MEM_BAS_ADD1_Pos)  /**< (SPI_SLAVE_SSPI_MEM1_BADD) Base Address for Region 1.\n Mask */
#define SPI_SLAVE_SSPI_MEM1_BADD_MEM_BAS_ADD1(value) (SPI_SLAVE_SSPI_MEM1_BADD_MEM_BAS_ADD1_Msk & ((value) << SPI_SLAVE_SSPI_MEM1_BADD_MEM_BAS_ADD1_Pos))
#define SPI_SLAVE_SSPI_MEM1_BADD_Msk          (0xFFFFFFFFUL)                                 /**< (SPI_SLAVE_SSPI_MEM1_BADD) Register Mask  */

/* -------- SPI_SLAVE_SSPI_MEM1_WR_LMT : (SPI_SLAVE Offset: 0x28) (R/W 32) SPI Slave Memory Write LIMIT 1 Register.\n -------- */

typedef union
{
  struct
  {
    uint32_t WR_LMT1:15;                /**< bit:  0..14  Write Limit for Region 1.\n                   */
    uint32_t :17;                       /**< bit: 15..31  Reserved                                      */
  };
  uint32_t w;
} __SPI_SLAVE_SSPI_MEM1_WR_LMT_bits_t;
#define SPI_SLAVE_SSPI_MEM1_WR_LMT_RESETVALUE (0x00U)                                       /**<  (SPI_SLAVE_SSPI_MEM1_WR_LMT) SPI Slave Memory Write LIMIT 1 Register.\n  Reset Value */

#define SPI_SLAVE_SSPI_MEM1_WR_LMT_WR_LMT1_Pos (0)                                            /**< (SPI_SLAVE_SSPI_MEM1_WR_LMT) Write Limit for Region 1.\n Position */
#define SPI_SLAVE_SSPI_MEM1_WR_LMT_WR_LMT1_Msk (0x7FFFU << SPI_SLAVE_SSPI_MEM1_WR_LMT_WR_LMT1_Pos)  /**< (SPI_SLAVE_SSPI_MEM1_WR_LMT) Write Limit for Region 1.\n Mask */
#define SPI_SLAVE_SSPI_MEM1_WR_LMT_WR_LMT1(value) (SPI_SLAVE_SSPI_MEM1_WR_LMT_WR_LMT1_Msk & ((value) << SPI_SLAVE_SSPI_MEM1_WR_LMT_WR_LMT1_Pos))
#define SPI_SLAVE_SSPI_MEM1_WR_LMT_Msk        (0x00007FFFUL)                                 /**< (SPI_SLAVE_SSPI_MEM1_WR_LMT) Register Mask  */

/* -------- SPI_SLAVE_SSPI_MEM1_RD_LMT : (SPI_SLAVE Offset: 0x2c) (R/W 32) SPI Slave Memory Read LIMIT 1 Register.\n -------- */

typedef union
{
  struct
  {
    uint32_t RD_LMT1:15;                /**< bit:  0..14  Read Limit for Region 1.\n                    */
    uint32_t :17;                       /**< bit: 15..31  Reserved                                      */
  };
  uint32_t w;
} __SPI_SLAVE_SSPI_MEM1_RD_LMT_bits_t;
