ranjithaguna/pv/LED_Demo/source/pic32cx/component/spi_slave.h
#define SPI_SLAVE_SSPI_MEM1_RD_LMT_RESETVALUE (0x00U)                                       /**<  (SPI_SLAVE_SSPI_MEM1_RD_LMT) SPI Slave Memory Read LIMIT 1 Register.\n  Reset Value */

#define SPI_SLAVE_SSPI_MEM1_RD_LMT_RD_LMT1_Pos (0)                                            /**< (SPI_SLAVE_SSPI_MEM1_RD_LMT) Read Limit for Region 1.\n Position */
#define SPI_SLAVE_SSPI_MEM1_RD_LMT_RD_LMT1_Msk (0x7FFFU << SPI_SLAVE_SSPI_MEM1_RD_LMT_RD_LMT1_Pos)  /**< (SPI_SLAVE_SSPI_MEM1_RD_LMT) Read Limit for Region 1.\n Mask */
#define SPI_SLAVE_SSPI_MEM1_RD_LMT_RD_LMT1(value) (SPI_SLAVE_SSPI_MEM1_RD_LMT_RD_LMT1_Msk & ((value) << SPI_SLAVE_SSPI_MEM1_RD_LMT_RD_LMT1_Pos))
#define SPI_SLAVE_SSPI_MEM1_RD_LMT_Msk        (0x00007FFFUL)                                 /**< (SPI_SLAVE_SSPI_MEM1_RD_LMT) Register Mask  */

/* -------- SPI_SLAVE_SSPI_RXFIFO_BAR : (SPI_SLAVE Offset: 0x30) (R/ 32) SPI Slave RX FIFO Host Bar Register.\n -------- */

typedef union
{
  struct
  {
    uint32_t RXFIFO_BAR:16;             /**< bit:  0..15  RX FIFO Host Bar Register.\n                  */
    uint32_t :16;                       /**< bit: 16..31  Reserved                                      */
  };
  uint32_t w;
} __SPI_SLAVE_SSPI_RXFIFO_BAR_bits_t;
#define SPI_SLAVE_SSPI_RXFIFO_BAR_RESETVALUE (0x00U)                                       /**<  (SPI_SLAVE_SSPI_RXFIFO_BAR) SPI Slave RX FIFO Host Bar Register.\n  Reset Value */

#define SPI_SLAVE_SSPI_RXFIFO_BAR_RXFIFO_BAR_Pos (0)                                            /**< (SPI_SLAVE_SSPI_RXFIFO_BAR) RX FIFO Host Bar Register.\n Position */
#define SPI_SLAVE_SSPI_RXFIFO_BAR_RXFIFO_BAR_Msk (0xFFFFU << SPI_SLAVE_SSPI_RXFIFO_BAR_RXFIFO_BAR_Pos)  /**< (SPI_SLAVE_SSPI_RXFIFO_BAR) RX FIFO Host Bar Register.\n Mask */
#define SPI_SLAVE_SSPI_RXFIFO_BAR_RXFIFO_BAR(value) (SPI_SLAVE_SSPI_RXFIFO_BAR_RXFIFO_BAR_Msk & ((value) << SPI_SLAVE_SSPI_RXFIFO_BAR_RXFIFO_BAR_Pos))
#define SPI_SLAVE_SSPI_RXFIFO_BAR_Msk         (0x0000FFFFUL)                                 /**< (SPI_SLAVE_SSPI_RXFIFO_BAR) Register Mask  */

/* -------- SPI_SLAVE_SSPI_RXFIFO_CNT : (SPI_SLAVE Offset: 0x34) (R/ 32) SPI Slave RX FIFO Byte Counter Register.\n -------- */

typedef union
{
  struct
  {
    uint32_t RXFIFO_BCNT:15;            /**< bit:  0..14  RX FIFO Byte Count Register.\n                */
    uint32_t :17;                       /**< bit: 15..31  Reserved                                      */
  };
  uint32_t w;
} __SPI_SLAVE_SSPI_RXFIFO_CNT_bits_t;
#define SPI_SLAVE_SSPI_RXFIFO_CNT_RESETVALUE (0x00U)                                       /**<  (SPI_SLAVE_SSPI_RXFIFO_CNT) SPI Slave RX FIFO Byte Counter Register.\n  Reset Value */

#define SPI_SLAVE_SSPI_RXFIFO_CNT_RXFIFO_BCNT_Pos (0)                                            /**< (SPI_SLAVE_SSPI_RXFIFO_CNT) RX FIFO Byte Count Register.\n Position */
#define SPI_SLAVE_SSPI_RXFIFO_CNT_RXFIFO_BCNT_Msk (0x7FFFU << SPI_SLAVE_SSPI_RXFIFO_CNT_RXFIFO_BCNT_Pos)  /**< (SPI_SLAVE_SSPI_RXFIFO_CNT) RX FIFO Byte Count Register.\n Mask */
#define SPI_SLAVE_SSPI_RXFIFO_CNT_RXFIFO_BCNT(value) (SPI_SLAVE_SSPI_RXFIFO_CNT_RXFIFO_BCNT_Msk & ((value) << SPI_SLAVE_SSPI_RXFIFO_CNT_RXFIFO_BCNT_Pos))
#define SPI_SLAVE_SSPI_RXFIFO_CNT_Msk         (0x00007FFFUL)                                 /**< (SPI_SLAVE_SSPI_RXFIFO_CNT) Register Mask  */

/* -------- SPI_SLAVE_SSPI_TXFIFO_BAR : (SPI_SLAVE Offset: 0x38) (R/ 32) SPI Slave TX FIFO Host Bar Register.\n -------- */

typedef union
{
  struct
  {
    uint32_t TXFIFO_BAR:16;             /**< bit:  0..15  TX FIFO Host Bar Register.\n                  */
    uint32_t :16;                       /**< bit: 16..31  Reserved                                      */
  };
  uint32_t w;
} __SPI_SLAVE_SSPI_TXFIFO_BAR_bits_t;
#define SPI_SLAVE_SSPI_TXFIFO_BAR_RESETVALUE (0x00U)                                       /**<  (SPI_SLAVE_SSPI_TXFIFO_BAR) SPI Slave TX FIFO Host Bar Register.\n  Reset Value */

#define SPI_SLAVE_SSPI_TXFIFO_BAR_TXFIFO_BAR_Pos (0)                                            /**< (SPI_SLAVE_SSPI_TXFIFO_BAR) TX FIFO Host Bar Register.\n Position */
#define SPI_SLAVE_SSPI_TXFIFO_BAR_TXFIFO_BAR_Msk (0xFFFFU << SPI_SLAVE_SSPI_TXFIFO_BAR_TXFIFO_BAR_Pos)  /**< (SPI_SLAVE_SSPI_TXFIFO_BAR) TX FIFO Host Bar Register.\n Mask */
#define SPI_SLAVE_SSPI_TXFIFO_BAR_TXFIFO_BAR(value) (SPI_SLAVE_SSPI_TXFIFO_BAR_TXFIFO_BAR_Msk & ((value) << SPI_SLAVE_SSPI_TXFIFO_BAR_TXFIFO_BAR_Pos))
#define SPI_SLAVE_SSPI_TXFIFO_BAR_Msk         (0x0000FFFFUL)                                 /**< (SPI_SLAVE_SSPI_TXFIFO_BAR) Register Mask  */

/* -------- SPI_SLAVE_SSPI_TXFIFO_CNT : (SPI_SLAVE Offset: 0x3c) (R/ 32) SPI Slave TX FIFO Byte Counter Register.\n -------- */

typedef union
{
  struct
  {
    uint32_t TXFIFO_BCNT:15;            /**< bit:  0..14  TX FIFO Byte Count Register.\n                */
    uint32_t :17;                       /**< bit: 15..31  Reserved                                      */
  };
  uint32_t w;
} __SPI_SLAVE_SSPI_TXFIFO_CNT_bits_t;
#define SPI_SLAVE_SSPI_TXFIFO_CNT_RESETVALUE (0x00U)                                       /**<  (SPI_SLAVE_SSPI_TXFIFO_CNT) SPI Slave TX FIFO Byte Counter Register.\n  Reset Value */

#define SPI_SLAVE_SSPI_TXFIFO_CNT_TXFIFO_BCNT_Pos (0)                                            /**< (SPI_SLAVE_SSPI_TXFIFO_CNT) TX FIFO Byte Count Register.\n Position */
#define SPI_SLAVE_SSPI_TXFIFO_CNT_TXFIFO_BCNT_Msk (0x7FFFU << SPI_SLAVE_SSPI_TXFIFO_CNT_TXFIFO_BCNT_Pos)  /**< (SPI_SLAVE_SSPI_TXFIFO_CNT) TX FIFO Byte Count Register.\n Mask */
#define SPI_SLAVE_SSPI_TXFIFO_CNT_TXFIFO_BCNT(value) (SPI_SLAVE_SSPI_TXFIFO_CNT_TXFIFO_BCNT_Msk & ((value) << SPI_SLAVE_SSPI_TXFIFO_CNT_TXFIFO_BCNT_Pos))
#define SPI_SLAVE_SSPI_TXFIFO_CNT_Msk         (0x00007FFFUL)                                 /**< (SPI_SLAVE_SSPI_TXFIFO_CNT) Register Mask  */

/* -------- SPI_SLAVE_SSPI_SYS_CNFG : (SPI_SLAVE Offset: 0x40) (R/W 32) SPI Slave System Configuration Register.\n -------- */

typedef union
{
  struct
  {
    uint32_t SOFT_RST:1;                /**< bit:      0  Soft reset for entire SPI Slave Block. This bit is self clearing.\n */
    uint32_t LOCK_QUAD_SNGL_WRMOD:1;    /**< bit:      1  Lock Quad / Single Write Mode bit, write access from SPI Master.\n */
    uint32_t LOCK_TAR_TIME:1;           /**< bit:      2  Lock Tar Time bit, write access from SPI Master.\n */
    uint32_t LOCK_WAIT_CYCL:1;          /**< bit:      3  Lock Wait Cycle bits, write access from SPI Master.\n */
    uint32_t LOCK_MEM_CFG:1;            /**< bit:      4  Lock Memory Configuration register, write access from SPI Master.\n */
    uint32_t LOCK_SPIINT_EN:1;          /**< bit:      5  Lock SPI Interrupt Enable register, write access from SPI Master.\n */
    uint32_t LOCK_MEM_BAR0:1;           /**< bit:      6  Lock Memory Bar 0 register, write access from SPI Master.\n */
    uint32_t LOCK_MEM_BAR1:1;           /**< bit:      7  Lock Memory Bar 1 register, write access from SPI Master.\n */
    uint32_t :2;                        /**< bit:   8..9  Reserved                                      */
    uint32_t LOCK_TEST_MODE:1;          /**< bit:     10  Lock TEST Mode register, write access from SPI Master.\n */
    uint32_t :5;                        /**< bit: 11..15  Reserved                                      */
    uint32_t SPI_SLAVE_EN:1;            /**< bit:     16  Enable / Disable SPI Slave Block.\n         0 = Disable SPI Slave module.\n         1 = Enable SPI Slave module.\n */
    uint32_t MASK_EC_REG:1;             /**< bit:     17  Mask EC register 'fld_mask_ec_register' from SPI Master. All the register are         neither readable now writable from SPI Master.\n */
    uint32_t SIMPLE_EN:1;               /**< bit:     18  Enable SPI Slave Simple Mode operation.\n     */
    uint32_t EC_DATA_AVAIL:1;           /**< bit:     19  Notification to TX FIFO Engine that data is available for AHB Transfer. This register         but is cleared by Hardware at the end of the transaction, with SPI_CS_N de-assertion.         (R/WC).\n */
    uint32_t :12;                       /**< bit: 20..31  Reserved                                      */
  };
  struct
  {
    uint32_t :6;                        /**< bit:   0..5  Reserved                                      */
    uint32_t LOCK_MEM_BAR:2;            /**< bit:   6..7  Lock Memory Bar x register, write access from SPI Master.\n */
    uint32_t :24;                       /**< bit:  8..31  Reserved                                      */
  };
  uint32_t w;
} __SPI_SLAVE_SSPI_SYS_CNFG_bits_t;
