ranjithaguna/pv/LED_Demo/source/pic32cx/component/spi_slave.h
#define SPI_SLAVE_SSPI_SYS_CNFG_RESETVALUE  (0x4C0U)                                      /**<  (SPI_SLAVE_SSPI_SYS_CNFG) SPI Slave System Configuration Register.\n  Reset Value */

#define SPI_SLAVE_SSPI_SYS_CNFG_SOFT_RST_Pos  (0)                                            /**< (SPI_SLAVE_SSPI_SYS_CNFG) Soft reset for entire SPI Slave Block. This bit is self clearing.\n Position */
#define SPI_SLAVE_SSPI_SYS_CNFG_SOFT_RST_Msk  (0x1U << SPI_SLAVE_SSPI_SYS_CNFG_SOFT_RST_Pos)  /**< (SPI_SLAVE_SSPI_SYS_CNFG) Soft reset for entire SPI Slave Block. This bit is self clearing.\n Mask */
#define SPI_SLAVE_SSPI_SYS_CNFG_LOCK_QUAD_SNGL_WRMOD_Pos (1)                                            /**< (SPI_SLAVE_SSPI_SYS_CNFG) Lock Quad / Single Write Mode bit, write access from SPI Master.\n Position */
#define SPI_SLAVE_SSPI_SYS_CNFG_LOCK_QUAD_SNGL_WRMOD_Msk (0x1U << SPI_SLAVE_SSPI_SYS_CNFG_LOCK_QUAD_SNGL_WRMOD_Pos)  /**< (SPI_SLAVE_SSPI_SYS_CNFG) Lock Quad / Single Write Mode bit, write access from SPI Master.\n Mask */
#define SPI_SLAVE_SSPI_SYS_CNFG_LOCK_TAR_TIME_Pos (2)                                            /**< (SPI_SLAVE_SSPI_SYS_CNFG) Lock Tar Time bit, write access from SPI Master.\n Position */
#define SPI_SLAVE_SSPI_SYS_CNFG_LOCK_TAR_TIME_Msk (0x1U << SPI_SLAVE_SSPI_SYS_CNFG_LOCK_TAR_TIME_Pos)  /**< (SPI_SLAVE_SSPI_SYS_CNFG) Lock Tar Time bit, write access from SPI Master.\n Mask */
#define SPI_SLAVE_SSPI_SYS_CNFG_LOCK_WAIT_CYCL_Pos (3)                                            /**< (SPI_SLAVE_SSPI_SYS_CNFG) Lock Wait Cycle bits, write access from SPI Master.\n Position */
#define SPI_SLAVE_SSPI_SYS_CNFG_LOCK_WAIT_CYCL_Msk (0x1U << SPI_SLAVE_SSPI_SYS_CNFG_LOCK_WAIT_CYCL_Pos)  /**< (SPI_SLAVE_SSPI_SYS_CNFG) Lock Wait Cycle bits, write access from SPI Master.\n Mask */
#define SPI_SLAVE_SSPI_SYS_CNFG_LOCK_MEM_CFG_Pos (4)                                            /**< (SPI_SLAVE_SSPI_SYS_CNFG) Lock Memory Configuration register, write access from SPI Master.\n Position */
#define SPI_SLAVE_SSPI_SYS_CNFG_LOCK_MEM_CFG_Msk (0x1U << SPI_SLAVE_SSPI_SYS_CNFG_LOCK_MEM_CFG_Pos)  /**< (SPI_SLAVE_SSPI_SYS_CNFG) Lock Memory Configuration register, write access from SPI Master.\n Mask */
#define SPI_SLAVE_SSPI_SYS_CNFG_LOCK_SPIINT_EN_Pos (5)                                            /**< (SPI_SLAVE_SSPI_SYS_CNFG) Lock SPI Interrupt Enable register, write access from SPI Master.\n Position */
#define SPI_SLAVE_SSPI_SYS_CNFG_LOCK_SPIINT_EN_Msk (0x1U << SPI_SLAVE_SSPI_SYS_CNFG_LOCK_SPIINT_EN_Pos)  /**< (SPI_SLAVE_SSPI_SYS_CNFG) Lock SPI Interrupt Enable register, write access from SPI Master.\n Mask */
#define SPI_SLAVE_SSPI_SYS_CNFG_LOCK_MEM_BAR0_Pos (6)                                            /**< (SPI_SLAVE_SSPI_SYS_CNFG) Lock Memory Bar 0 register, write access from SPI Master.\n Position */
#define SPI_SLAVE_SSPI_SYS_CNFG_LOCK_MEM_BAR0_Msk (0x1U << SPI_SLAVE_SSPI_SYS_CNFG_LOCK_MEM_BAR0_Pos)  /**< (SPI_SLAVE_SSPI_SYS_CNFG) Lock Memory Bar 0 register, write access from SPI Master.\n Mask */
#define SPI_SLAVE_SSPI_SYS_CNFG_LOCK_MEM_BAR1_Pos (7)                                            /**< (SPI_SLAVE_SSPI_SYS_CNFG) Lock Memory Bar 1 register, write access from SPI Master.\n Position */
#define SPI_SLAVE_SSPI_SYS_CNFG_LOCK_MEM_BAR1_Msk (0x1U << SPI_SLAVE_SSPI_SYS_CNFG_LOCK_MEM_BAR1_Pos)  /**< (SPI_SLAVE_SSPI_SYS_CNFG) Lock Memory Bar 1 register, write access from SPI Master.\n Mask */
#define SPI_SLAVE_SSPI_SYS_CNFG_LOCK_TEST_MODE_Pos (10)                                           /**< (SPI_SLAVE_SSPI_SYS_CNFG) Lock TEST Mode register, write access from SPI Master.\n Position */
#define SPI_SLAVE_SSPI_SYS_CNFG_LOCK_TEST_MODE_Msk (0x1U << SPI_SLAVE_SSPI_SYS_CNFG_LOCK_TEST_MODE_Pos)  /**< (SPI_SLAVE_SSPI_SYS_CNFG) Lock TEST Mode register, write access from SPI Master.\n Mask */
#define SPI_SLAVE_SSPI_SYS_CNFG_SPI_SLAVE_EN_Pos (16)                                           /**< (SPI_SLAVE_SSPI_SYS_CNFG) Enable / Disable SPI Slave Block.\n         0 = Disable SPI Slave module.\n         1 = Enable SPI Slave module.\n Position */
#define SPI_SLAVE_SSPI_SYS_CNFG_SPI_SLAVE_EN_Msk (0x1U << SPI_SLAVE_SSPI_SYS_CNFG_SPI_SLAVE_EN_Pos)  /**< (SPI_SLAVE_SSPI_SYS_CNFG) Enable / Disable SPI Slave Block.\n         0 = Disable SPI Slave module.\n         1 = Enable SPI Slave module.\n Mask */
#define SPI_SLAVE_SSPI_SYS_CNFG_MASK_EC_REG_Pos (17)                                           /**< (SPI_SLAVE_SSPI_SYS_CNFG) Mask EC register 'fld_mask_ec_register' from SPI Master. All the register are         neither readable now writable from SPI Master.\n Position */
#define SPI_SLAVE_SSPI_SYS_CNFG_MASK_EC_REG_Msk (0x1U << SPI_SLAVE_SSPI_SYS_CNFG_MASK_EC_REG_Pos)  /**< (SPI_SLAVE_SSPI_SYS_CNFG) Mask EC register 'fld_mask_ec_register' from SPI Master. All the register are         neither readable now writable from SPI Master.\n Mask */
#define SPI_SLAVE_SSPI_SYS_CNFG_SIMPLE_EN_Pos (18)                                           /**< (SPI_SLAVE_SSPI_SYS_CNFG) Enable SPI Slave Simple Mode operation.\n Position */
#define SPI_SLAVE_SSPI_SYS_CNFG_SIMPLE_EN_Msk (0x1U << SPI_SLAVE_SSPI_SYS_CNFG_SIMPLE_EN_Pos)  /**< (SPI_SLAVE_SSPI_SYS_CNFG) Enable SPI Slave Simple Mode operation.\n Mask */
#define SPI_SLAVE_SSPI_SYS_CNFG_EC_DATA_AVAIL_Pos (19)                                           /**< (SPI_SLAVE_SSPI_SYS_CNFG) Notification to TX FIFO Engine that data is available for AHB Transfer. This register         but is cleared by Hardware at the end of the transaction, with SPI_CS_N de-assertion.         (R/WC).\n Position */
#define SPI_SLAVE_SSPI_SYS_CNFG_EC_DATA_AVAIL_Msk (0x1U << SPI_SLAVE_SSPI_SYS_CNFG_EC_DATA_AVAIL_Pos)  /**< (SPI_SLAVE_SSPI_SYS_CNFG) Notification to TX FIFO Engine that data is available for AHB Transfer. This register         but is cleared by Hardware at the end of the transaction, with SPI_CS_N de-assertion.         (R/WC).\n Mask */
#define SPI_SLAVE_SSPI_SYS_CNFG_Msk           (0x000F04FFUL)                                 /**< (SPI_SLAVE_SSPI_SYS_CNFG) Register Mask  */
#define SPI_SLAVE_SSPI_SYS_CNFG_LOCK_MEM_BAR_Pos (6)                                            /**< (SPI_SLAVE_SSPI_SYS_CNFG Position) Lock Memory Bar x register, write access from SPI Master.\n */
#define SPI_SLAVE_SSPI_SYS_CNFG_LOCK_MEM_BAR_Msk (0x3U << SPI_SLAVE_SSPI_SYS_CNFG_LOCK_MEM_BAR_Pos)  /**< (SPI_SLAVE_SSPI_SYS_CNFG Mask) LOCK_MEM_BAR */
#define SPI_SLAVE_SSPI_SYS_CNFG_LOCK_MEM_BAR(value) (SPI_SLAVE_SSPI_SYS_CNFG_LOCK_MEM_BAR_Msk & ((value) << SPI_SLAVE_SSPI_SYS_CNFG_LOCK_MEM_BAR_Pos))

/* -------- SPI_SLAVE_SSPI_MAST2EC_MLX : (SPI_SLAVE Offset: 0x44) (R/W 32) SPI Slave Master to EC Mailbox Register.\n -------- */

typedef union
{
  struct
  {
    uint32_t MAST2EC_MLX:32;            /**< bit:  0..31  Write only register for the Host. When data is written to this register the IBF Flag         is set. EC can read the data and writes of 0xFFFF will clear this register. Any form of         read will clear the flag for this register.\n */
  };
  uint32_t w;
} __SPI_SLAVE_SSPI_MAST2EC_MLX_bits_t;
#define SPI_SLAVE_SSPI_MAST2EC_MLX_RESETVALUE (0x00U)                                       /**<  (SPI_SLAVE_SSPI_MAST2EC_MLX) SPI Slave Master to EC Mailbox Register.\n  Reset Value */

#define SPI_SLAVE_SSPI_MAST2EC_MLX_MAST2EC_MLX_Pos (0)                                            /**< (SPI_SLAVE_SSPI_MAST2EC_MLX) Write only register for the Host. When data is written to this register the IBF Flag         is set. EC can read the data and writes of 0xFFFF will clear this register. Any form of         read will clear the flag for this register.\n Position */
#define SPI_SLAVE_SSPI_MAST2EC_MLX_MAST2EC_MLX_Msk (0xFFFFFFFFU << SPI_SLAVE_SSPI_MAST2EC_MLX_MAST2EC_MLX_Pos)  /**< (SPI_SLAVE_SSPI_MAST2EC_MLX) Write only register for the Host. When data is written to this register the IBF Flag         is set. EC can read the data and writes of 0xFFFF will clear this register. Any form of         read will clear the flag for this register.\n Mask */
#define SPI_SLAVE_SSPI_MAST2EC_MLX_MAST2EC_MLX(value) (SPI_SLAVE_SSPI_MAST2EC_MLX_MAST2EC_MLX_Msk & ((value) << SPI_SLAVE_SSPI_MAST2EC_MLX_MAST2EC_MLX_Pos))
#define SPI_SLAVE_SSPI_MAST2EC_MLX_Msk        (0xFFFFFFFFUL)                                 /**< (SPI_SLAVE_SSPI_MAST2EC_MLX) Register Mask  */

/* -------- SPI_SLAVE_SSPI_EC2MAST_MLX : (SPI_SLAVE Offset: 0x48) (R/W 32) SPI Slave Master to EC Mailbox Register.\n -------- */

typedef union
{
  struct
  {
    uint32_t EC2MAST_MLX:32;            /**< bit:  0..31  Read only register for the Host. When data is written to this register the OBF Flag         is set. Host can read the data and writes of 0xFFFF_FFFF will clear this register, also         clearing the flag. Any form of read will clear the flag for this register\n */
  };
  uint32_t w;
} __SPI_SLAVE_SSPI_EC2MAST_MLX_bits_t;
#define SPI_SLAVE_SSPI_EC2MAST_MLX_RESETVALUE (0x00U)                                       /**<  (SPI_SLAVE_SSPI_EC2MAST_MLX) SPI Slave Master to EC Mailbox Register.\n  Reset Value */

