ranjithaguna/pv/LED_Demo/source/pic32cx/component/spi_slave.h
#define SPI_SLAVE_SSPI_EC2MAST_MLX_EC2MAST_MLX_Pos (0)                                            /**< (SPI_SLAVE_SSPI_EC2MAST_MLX) Read only register for the Host. When data is written to this register the OBF Flag         is set. Host can read the data and writes of 0xFFFF_FFFF will clear this register, also         clearing the flag. Any form of read will clear the flag for this register\n Position */
#define SPI_SLAVE_SSPI_EC2MAST_MLX_EC2MAST_MLX_Msk (0xFFFFFFFFU << SPI_SLAVE_SSPI_EC2MAST_MLX_EC2MAST_MLX_Pos)  /**< (SPI_SLAVE_SSPI_EC2MAST_MLX) Read only register for the Host. When data is written to this register the OBF Flag         is set. Host can read the data and writes of 0xFFFF_FFFF will clear this register, also         clearing the flag. Any form of read will clear the flag for this register\n Mask */
#define SPI_SLAVE_SSPI_EC2MAST_MLX_EC2MAST_MLX(value) (SPI_SLAVE_SSPI_EC2MAST_MLX_EC2MAST_MLX_Msk & ((value) << SPI_SLAVE_SSPI_EC2MAST_MLX_EC2MAST_MLX_Pos))
#define SPI_SLAVE_SSPI_EC2MAST_MLX_Msk        (0xFFFFFFFFUL)                                 /**< (SPI_SLAVE_SSPI_EC2MAST_MLX) Register Mask  */

/** \brief SPI_SLAVE register offsets definitions */
#define SPI_SLAVE_SSPI_CMM_CNFG_OFFSET (0x00)         /**< (SPI_SLAVE_SSPI_CMM_CNFG) SPI Slave Communication Configuration Register.\n Offset */
#define SPI_SLAVE_SSPI_STATUS_OFFSET (0x04)         /**< (SPI_SLAVE_SSPI_STATUS) SPI Slave Status Register.\n Offset */
#define SPI_SLAVE_SSPI_EC_STATUS_OFFSET (0x08)         /**< (SPI_SLAVE_SSPI_EC_STATUS) SPI Slave EC Status Register.\n Offset */
#define SPI_SLAVE_SSPI_INT_EN_OFFSET (0x0C)         /**< (SPI_SLAVE_SSPI_INT_EN) SPI Slave Interrupt Enable Register.\n Offset */
#define SPI_SLAVE_SSPI_EC_INT_EN_OFFSET (0x10)         /**< (SPI_SLAVE_SSPI_EC_INT_EN) SPI Slave EC Interrupt Enable Register.\n Offset */
#define SPI_SLAVE_SSPI_MEM_CFG_OFFSET (0x14)         /**< (SPI_SLAVE_SSPI_MEM_CFG) SPI Slave Memory Configuration Register.\n Offset */
#define SPI_SLAVE_SSPI_MEM0_BADD_OFFSET (0x18)         /**< (SPI_SLAVE_SSPI_MEM0_BADD) SPI Slave Memory Base Address0 Register.\n Offset */
#define SPI_SLAVE_SSPI_MEM0_WR_LMT_OFFSET (0x1C)         /**< (SPI_SLAVE_SSPI_MEM0_WR_LMT) SPI Slave Memory Write LIMIT 0 Register.\n Offset */
#define SPI_SLAVE_SSPI_MEM0_RD_LMT_OFFSET (0x20)         /**< (SPI_SLAVE_SSPI_MEM0_RD_LMT) SPI Slave Memory Read LIMIT 0 Register.\n Offset */
#define SPI_SLAVE_SSPI_MEM1_BADD_OFFSET (0x24)         /**< (SPI_SLAVE_SSPI_MEM1_BADD) SPI Slave Memory Base Address1 Register.\n Offset */
#define SPI_SLAVE_SSPI_MEM1_WR_LMT_OFFSET (0x28)         /**< (SPI_SLAVE_SSPI_MEM1_WR_LMT) SPI Slave Memory Write LIMIT 1 Register.\n Offset */
#define SPI_SLAVE_SSPI_MEM1_RD_LMT_OFFSET (0x2C)         /**< (SPI_SLAVE_SSPI_MEM1_RD_LMT) SPI Slave Memory Read LIMIT 1 Register.\n Offset */
#define SPI_SLAVE_SSPI_RXFIFO_BAR_OFFSET (0x30)         /**< (SPI_SLAVE_SSPI_RXFIFO_BAR) SPI Slave RX FIFO Host Bar Register.\n Offset */
#define SPI_SLAVE_SSPI_RXFIFO_CNT_OFFSET (0x34)         /**< (SPI_SLAVE_SSPI_RXFIFO_CNT) SPI Slave RX FIFO Byte Counter Register.\n Offset */
#define SPI_SLAVE_SSPI_TXFIFO_BAR_OFFSET (0x38)         /**< (SPI_SLAVE_SSPI_TXFIFO_BAR) SPI Slave TX FIFO Host Bar Register.\n Offset */
#define SPI_SLAVE_SSPI_TXFIFO_CNT_OFFSET (0x3C)         /**< (SPI_SLAVE_SSPI_TXFIFO_CNT) SPI Slave TX FIFO Byte Counter Register.\n Offset */
#define SPI_SLAVE_SSPI_SYS_CNFG_OFFSET (0x40)         /**< (SPI_SLAVE_SSPI_SYS_CNFG) SPI Slave System Configuration Register.\n Offset */
#define SPI_SLAVE_SSPI_MAST2EC_MLX_OFFSET (0x44)         /**< (SPI_SLAVE_SSPI_MAST2EC_MLX) SPI Slave Master to EC Mailbox Register.\n Offset */
#define SPI_SLAVE_SSPI_EC2MAST_MLX_OFFSET (0x48)         /**< (SPI_SLAVE_SSPI_EC2MAST_MLX) SPI Slave Master to EC Mailbox Register.\n Offset */

/** \brief SPI_SLAVE register API structure */
typedef struct
{  /* SPI Slave Register. */
  __IO  __SPI_SLAVE_SSPI_CMM_CNFG_bits_t SSPI_CMM_CNFG; /**< Offset: 0x00 (R/W  32) SPI Slave Communication Configuration Register.\n */
  __IO  __SPI_SLAVE_SSPI_STATUS_bits_t SSPI_STATUS;   /**< Offset: 0x04 (R/W  32) SPI Slave Status Register.\n */
  __IO  __SPI_SLAVE_SSPI_EC_STATUS_bits_t SSPI_EC_STATUS; /**< Offset: 0x08 (R/W  32) SPI Slave EC Status Register.\n */
  __IO  __SPI_SLAVE_SSPI_INT_EN_bits_t SSPI_INT_EN;   /**< Offset: 0x0C (R/W  32) SPI Slave Interrupt Enable Register.\n */
  __IO  __SPI_SLAVE_SSPI_EC_INT_EN_bits_t SSPI_EC_INT_EN; /**< Offset: 0x10 (R/W  32) SPI Slave EC Interrupt Enable Register.\n */
  __IO  __SPI_SLAVE_SSPI_MEM_CFG_bits_t SSPI_MEM_CFG;  /**< Offset: 0x14 (R/W  32) SPI Slave Memory Configuration Register.\n */
  __IO  __SPI_SLAVE_SSPI_MEM0_BADD_bits_t SSPI_MEM0_BADD; /**< Offset: 0x18 (R/W  32) SPI Slave Memory Base Address0 Register.\n */
  __IO  __SPI_SLAVE_SSPI_MEM0_WR_LMT_bits_t SSPI_MEM0_WR_LMT; /**< Offset: 0x1C (R/W  32) SPI Slave Memory Write LIMIT 0 Register.\n */
  __IO  __SPI_SLAVE_SSPI_MEM0_RD_LMT_bits_t SSPI_MEM0_RD_LMT; /**< Offset: 0x20 (R/W  32) SPI Slave Memory Read LIMIT 0 Register.\n */
  __IO  __SPI_SLAVE_SSPI_MEM1_BADD_bits_t SSPI_MEM1_BADD; /**< Offset: 0x24 (R/W  32) SPI Slave Memory Base Address1 Register.\n */
  __IO  __SPI_SLAVE_SSPI_MEM1_WR_LMT_bits_t SSPI_MEM1_WR_LMT; /**< Offset: 0x28 (R/W  32) SPI Slave Memory Write LIMIT 1 Register.\n */
  __IO  __SPI_SLAVE_SSPI_MEM1_RD_LMT_bits_t SSPI_MEM1_RD_LMT; /**< Offset: 0x2C (R/W  32) SPI Slave Memory Read LIMIT 1 Register.\n */
  __I   __SPI_SLAVE_SSPI_RXFIFO_BAR_bits_t SSPI_RXFIFO_BAR; /**< Offset: 0x30 (R/   32) SPI Slave RX FIFO Host Bar Register.\n */
  __I   __SPI_SLAVE_SSPI_RXFIFO_CNT_bits_t SSPI_RXFIFO_CNT; /**< Offset: 0x34 (R/   32) SPI Slave RX FIFO Byte Counter Register.\n */
  __I   __SPI_SLAVE_SSPI_TXFIFO_BAR_bits_t SSPI_TXFIFO_BAR; /**< Offset: 0x38 (R/   32) SPI Slave TX FIFO Host Bar Register.\n */
  __I   __SPI_SLAVE_SSPI_TXFIFO_CNT_bits_t SSPI_TXFIFO_CNT; /**< Offset: 0x3C (R/   32) SPI Slave TX FIFO Byte Counter Register.\n */
  __IO  __SPI_SLAVE_SSPI_SYS_CNFG_bits_t SSPI_SYS_CNFG; /**< Offset: 0x40 (R/W  32) SPI Slave System Configuration Register.\n */
  __IO  __SPI_SLAVE_SSPI_MAST2EC_MLX_bits_t SSPI_MAST2EC_MLX; /**< Offset: 0x44 (R/W  32) SPI Slave Master to EC Mailbox Register.\n */
  __IO  __SPI_SLAVE_SSPI_EC2MAST_MLX_bits_t SSPI_EC2MAST_MLX; /**< Offset: 0x48 (R/W  32) SPI Slave Master to EC Mailbox Register.\n */
} spislave_registers_t;
/** @}  end of SPI Slave Register. */

#endif /* _PIC32CX_0525SG12_SPI_SLAVE_COMPONENT_H_ */
